{
  "databases": [
    "acm"
  ],
  "limit": null,
  "limit_per_database": null,
  "number_of_papers": 13,
  "number_of_papers_by_database": {
    "ACM": 13
  },
  "papers": [
    {
      "abstract": "Outstanding steps towards intelligent transportation systems with autonomous vehicles have been taken in the past few years. Nevertheless, the safety issue in autonomous vehicles is critical and remains to be fully solved. Sensor data provide information about the internal status of the system and the impact of its external environment, where the occurrence of sensor data anomalies indicates the existence of potential safety risks. Therefore, in this work, a taxonomy for potential sensor data anomaly sources from the perspective of road vehicle safety is proposed, motivated by the lack of a unified comprehensive taxonomy of sensor data anomaly identification for autonomous vehicles. In this context, sources are divided into; 1) fault or failure of the components or subsystems; 2) failure of the adaptability to the external environment; 3) cyber-attacks; and 4) faults or design deficiencies of sensors. Based on the taxonomy proposed, related works, and in particular, countermeasures for the four potential sources of sensor data anomalies in autonomous vehicles are then reviewed. In the context of providing a comprehensive discussion, other taxonomies of potential sources causing sensor data anomalies for autonomous vehicles and the issue of interpretability of sensor data anomalies are also discussed, providing insight into the strengths of the proposed taxonomy.",
      "authors": [
        "Xiangmo Zhao",
        "Yukun Fang",
        "Haigen Min",
        "Xia Wu",
        "Wuqi Wang",
        "Rui Teixeira"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.eswa.2023.121358",
      "keywords": [
        "Sensor data anomaly sources",
        "Road vehicle safety",
        "Autonomous vehicles"
      ],
      "number_of_pages": 18,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 12.6,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0957-4174",
        "publisher": "Elsevier Ltd.",
        "sjr": 1.873,
        "snip": 2.582,
        "subject_areas": [
          "Computer Science Applications",
          "Engineering (all)",
          "Artificial Intelligence"
        ],
        "title": "Expert Syst. Appl."
      },
      "publication_date": "2024-02-01",
      "selected": null,
      "title": "Potential sources of sensor data anomalies for autonomous vehicles: An overview from road vehicle safety perspective",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.eswa.2023.121358"
      ]
    },
    {
      "abstract": "Scheme outperforms state-of-art in terms of security, imperceptibility, and robustness.",
      "authors": [
        "K. Jyothsna Devi",
        "Priyanka Singh",
        "Muhammad Bilal",
        "Anand Nayyar"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.eswa.2023.121190",
      "keywords": [
        "DWT-SVD",
        "Symmetric cryptography",
        "Hybrid optimization",
        "GWO",
        "HSO",
        "H-Grey",
        "Digital Image Watermarking"
      ],
      "number_of_pages": 18,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 12.6,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0957-4174",
        "publisher": "Elsevier Ltd.",
        "sjr": 1.873,
        "snip": 2.582,
        "subject_areas": [
          "Computer Science Applications",
          "Engineering (all)",
          "Artificial Intelligence"
        ],
        "title": "Expert Syst. Appl."
      },
      "publication_date": "2024-02-01",
      "selected": null,
      "title": "Enabling secure image transmission in unmanned aerial vehicle using digital image watermarking with H-Grey optimization",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.eswa.2023.121190"
      ]
    },
    {
      "abstract": "Machine learning algorithms are increasingly used for inference and decision-making in embedded systems. Data from sensors are used to train machine learning models for various smart functions of embedded and cyber-physical systems ranging from applications in healthcare, autonomous vehicles, and national security. However, recent studies have shown that machine learning models can be fooled by adding adversarial noise to their inputs. The perturbed inputs are called adversarial examples. Furthermore, adversarial examples designed to fool one machine learning system are also often effective against another system. This property of adversarial examples is called adversarial transferability and has not been explored in wearable systems to date. In this work, we take the first stride in studying adversarial transferability in wearable sensor systems from four viewpoints: (1) transferability between machine learning models; (2) transferability across users/subjects of the embedded system; (3) transferability across sensor body locations; and (4) transferability across datasets used for model training. We present a set of carefully designed experiments to investigate these transferability scenarios. We also propose a threat model describing the interactions of an adversary with the source and target sensor systems in different transferability settings. In most cases, we found high untargeted transferability, whereas targeted transferability success scores varied from \\(0\\% \\) to \\(80\\% \\). The transferability of adversarial examples depends on many factors such as the inclusion of data from all subjects, sensor body position, number of samples in the dataset, type of learning algorithm, and the distribution of source and target system dataset. The transferability of adversarial examples decreased sharply when the data distribution of the source and target system became more distinct. We also provide guidelines and suggestions for the community for designing robust sensor systems. Code and dataset used in our analysis is publicly available here.",
      "authors": [
        "Ramesh Kumar Sah",
        "Hassan Ghasemzadeh"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3641861",
      "keywords": [
        "sensor systems",
        "adversarial transferability",
        "adversarial machine learning",
        "human activity recognition"
      ],
      "number_of_pages": null,
      "pages": null,
      "publication": {
        "category": "Journal",
        "cite_score": 4.5,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "1539-9087",
        "publisher": "Association for Computing Machinery (ACM)",
        "sjr": 0.796,
        "snip": 1.11,
        "subject_areas": [
          "Hardware and Architecture",
          "Software"
        ],
        "title": "ACM Trans. Embed. Comput. Syst."
      },
      "publication_date": "2024-01-22",
      "selected": null,
      "title": "Adversarial Transferability in Embedded Sensor Systems: An Activity Recognition Perspective",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3641861"
      ]
    },
    {
      "abstract": "In the past years, the automotive industry has experienced a technological revolution driven by the increasing demand of connectivity and data to develop driver-assistance systems and autonomous vehicles, and improve the mobility experience. To provide higher bandwidth in in-vehicle communication networks, carmakers are choosing Ethernet technology, which becomes Automotive Ethernet (AE) when applied in in-vehicle communication networks. However, with the rise of vehicle connectivity, the cybersecurity of vehicle systems has become a primary concern for the automotive industry. To address this issue, we conducted a systematic review, deeply analyzing the impact of AE on security and safety, and comparing it with the current in-vehicle communication solutions like Controller Area Network protocol. We retrieved the key security attacks and mitigations proposed in the current literature to highlight their significance, including a mapping between the regulation UNECE WP.29 R155 and the retrieved answers. We found that the industry has only implemented some automotive-dedicated Ethernet solutions to date. In the near future, the vehicle and road ecosystems may require more exclusive automotive solutions to meet specific constraints such as low latency. Our results can provide a comprehensive baseline, both for industry and academia, for the current and future development of AE.",
      "authors": [
        "Marco De Vincenzi",
        "Gianpiero Costantino",
        "Ilaria Matteucci",
        "Florian Fenzl",
        "Christian Plappert",
        "Roland Rieke",
        "Daniel Zelle"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3637059",
      "keywords": [
        "safety",
        "OSI model",
        "automotive",
        "Ethernet",
        "Security",
        "UNECE R155"
      ],
      "number_of_pages": 38,
      "pages": "1-38",
      "publication": {
        "category": "Journal",
        "cite_score": 28.5,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0360-0300",
        "publisher": "Association for Computing Machinery (ACM)",
        "sjr": 4.457,
        "snip": 7.155,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "ACM Comput. Surv."
      },
      "publication_date": "2024-01-22",
      "selected": null,
      "title": "A Systematic Review on Security Attacks and Countermeasures in Automotive Ethernet",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3637059"
      ]
    },
    {
      "abstract": " The concept of Internet of Vehicles (IoV) played an important role for the improvements that happened in the smart transportation field. Nowadays, it is one of the hot topics in academia, automotive sector, industry, and research. The message transfer between the vehicles or infrastructures are necessary for communication in a vehicular network. A public channel is used for all these types of communication, which offers adversary to get a chance to delete, modify, insert, and extract data. Similar to security, lightweight property is yet another important factor needed to be considered thoroughly because of the highly dynamic nature of IoVs. In the state-of-the-art, several schemes are designed separately for security and lightweight property; however, we have only a small number of works that discussed the importance of maintaining a balance between these two criteria. Among them all schemes use a secure medium for the registration process. Different from them, we used a public channel, which makes our scheme more vulnerable to attacks than the state-of-the-art. In this paper, we designed a lightweight, secure authentication and key agreement scheme (LightKey), which is strong enough to resist different types of attacks and at the same time lightweight as well. In particular, LightKey is resistant to replay, man-in-the-middle, impersonation, physical capture, session key disclosure, perfect forward secrecy, backward secrecy, and ephemeral secret leakage attacks. We have simulated LightKey in Scyther (automated security protocol verification tool) and proved that it is secure against the above mentioned attacks. The performance analysis results show that LightKey takes 10% less computation cost than most related competitive scheme, which makes it to fit in the On-Board Unit (OBU) of any vehicles easily.",
      "authors": [
        "Harsha Vasudev",
        "Mohd Shariq",
        "Sanjeev Kumar Dwivedi",
        "Mauro Conti"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3631461.3631558",
      "keywords": [
        "Key Agreement",
        "Lightweight Protocol",
        "Internet of Vehicles",
        "Security",
        "Authentication"
      ],
      "number_of_pages": 8,
      "pages": "209-216",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9798400716737",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 25th International Conference on Distributed Computing and Networking"
      },
      "publication_date": "2024-01-22",
      "selected": null,
      "title": "LightKey: Lightweight and Secure Key Agreement Protocol for Effective Communication in Internet of Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3631461.3631558"
      ]
    },
    {
      "abstract": " ",
      "authors": [
        "Yangyang Sun",
        "Xiangdong Jia",
        "Xianghua Han",
        "Mangang Xie",
        "Liang Zhang"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1002/ett.4915",
      "keywords": [],
      "number_of_pages": 35,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 6.4,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "2161-3915",
        "publisher": "John Wiley and Sons Ltd",
        "sjr": 0.802,
        "snip": 1.015,
        "subject_areas": [
          "Electrical and Electronic Engineering"
        ],
        "title": "Trans. Emerg. Telecommun. Technol."
      },
      "publication_date": "2024-01-15",
      "selected": null,
      "title": "Physical layer security‐oriented energy‐efficient resource allocation and trajectory design for UAV jammer over 5G millimeter wave cognitive relay system",
      "urls": [
        "https://dl.acm.org/doi/10.1002/ett.4915"
      ]
    },
    {
      "abstract": " ",
      "authors": [
        "Tarek Bouzid",
        "Noureddine Chaib",
        "Mohamed Lahcen Bensaad"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1002/ett.4920",
      "keywords": [],
      "number_of_pages": 27,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 6.4,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "2161-3915",
        "publisher": "John Wiley and Sons Ltd",
        "sjr": 0.802,
        "snip": 1.015,
        "subject_areas": [
          "Electrical and Electronic Engineering"
        ],
        "title": "Trans. Emerg. Telecommun. Technol."
      },
      "publication_date": "2024-01-15",
      "selected": null,
      "title": "Crowd‐sourced and incentive driven UAV system to assist with network slices",
      "urls": [
        "https://dl.acm.org/doi/10.1002/ett.4920"
      ]
    },
    {
      "abstract": "Deep Reinforcement Learning (DRL) is an essential subfield of Artificial Intelligence (AI), where agents interact with environments to learn policies for solving complex tasks. In recent years, DRL has achieved remarkable breakthroughs in various tasks, including video games, robotic control, quantitative trading, and autonomous driving. Despite its accomplishments, security and privacy-related issues still prevent us from deploying trustworthy DRL applications. For example, by manipulating the environment, an attacker can influence an agent’s actions, misleading it to behave abnormally. Additionally, an attacker can infer private training data and environmental information by maliciously interacting with DRL models, causing a privacy breach. In this survey, we systematically investigate the recent progress of security and privacy issues in the context of DRL. First, we present a holistic review of security-related attacks within DRL systems from the perspectives of single-agent and multi-agent systems, and review privacy-related attacks. Second, we review and classify defense methods used to address security-related challenges, including robust learning, anomaly detection, and game theory approaches. Third, we review and classify privacy-preserving technologies, including encryption, differential privacy, and policy confusion. Finally, we conclude the survey by discussing open issues and possible directions for future research in this field.",
      "authors": [
        "Kanghua Mo",
        "Peigen Ye",
        "Xiaojun Ren",
        "Shaowei Wang",
        "Wenjun Li",
        "Jin Li"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3640312",
      "keywords": [
        "Defense",
        "Deep Reinforcement Learning",
        "Adversarial Attack"
      ],
      "number_of_pages": null,
      "pages": null,
      "publication": {
        "category": "Journal",
        "cite_score": 28.5,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0360-0300",
        "publisher": "Association for Computing Machinery (ACM)",
        "sjr": 4.457,
        "snip": 7.155,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "ACM Comput. Surv."
      },
      "publication_date": "2024-01-12",
      "selected": null,
      "title": "Security and Privacy Issues in Deep Reinforcement Learning: Threats and Countermeasures",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3640312"
      ]
    },
    {
      "abstract": "Federated learning systems encounter various security risks, including backdoor, inference and adversarial attacks. Backdoor attacks within this context generally require careful trigger sample design involving candidate selection and automated optimization. Previous methods randomly selected trigger candidates from training dataset, disrupting sample distribution and blurring boundaries among them, which adversely affected the main task accuracy. Moreover, these methods employed non-optimized handcrafted triggers, resulting in a weakened backdoor mapping relationship and lower attack success rates. In this work, we propose a flexible backdoor attack approach, Trigger Sample Selection and Optimization (TSSO), motivated by neural network classification patterns. TSSO employs autoencoders and locality-sensitive hashing to select trigger candidates at class boundaries for precise injection. Furthermore, it iteratively refines trigger representations via the global model and historical outcomes, establishing a robust mapping relationship. TSSO is evaluated on four classical datasets with non-IID settings, outperforming state-of-the-art methods by achieving higher attack success rate in fewer rounds, prolonging the backdoor effect. In scalability tests, even with the defense deployed, TSSO achieved the attack success rate of over 80% with only 4% malicious clients (a poisoning rate of 1/640).",
      "authors": [
        "Deshan Yang",
        "Senlin Luo",
        "Jinjie Zhou",
        "Limin Pan",
        "Xiaonan Yang",
        "Jiyuan Xing"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.ins.2023.119743",
      "keywords": [
        "Sample selection",
        "Deep learning",
        "Federated learning",
        "Trigger optimization",
        "Backdoor attack",
        "Poisoning attack"
      ],
      "number_of_pages": 19,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 13.4,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0020-0255",
        "publisher": "Elsevier Inc.",
        "sjr": 2.285,
        "snip": 2.454,
        "subject_areas": [
          "Information Systems and Management",
          "Control and Systems Engineering",
          "Computer Science Applications",
          "Theoretical Computer Science",
          "Software",
          "Artificial Intelligence"
        ],
        "title": "Inf. Sci."
      },
      "publication_date": "2024-01-10",
      "selected": null,
      "title": "Efficient and persistent backdoor attack by boundary trigger set constructing against federated learning",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.ins.2023.119743"
      ]
    },
    {
      "abstract": "While the advent of Deep Reinforcement Learning (DRL) has substantially improved the efficiency of Autonomous Vehicles (AVs), it makes them vulnerable to backdoor attacks that can potentially cause traffic congestion or even collisions. Backdoor functionality is typically implanted by poisoning training datasets with stealthy malicious data, designed to preserve high accuracy on legitimate inputs while inducing desired misclassifications for specific adversary-selected inputs. Existing countermeasures against backdoors predominantly concentrate on image classification, utilizing image-based properties, rendering these methods inapplicable to the regression tasks of DRL-based AV controllers that rely on continuous sensor data as inputs. In this paper, we introduce the first-ever defense against backdoors on regression tasks of DRL-based models, called Backdozer. Our method systematically extracts more abstract features from representations of training data by projecting them into a specific latent subspace and segregating them into several disjoint groups based on the distribution of legitimate outputs. The key observation of Backdozer is that authentic representations for each group reside in one latent subspace, whereas the incorporation of malicious data impacts that subspace. Backdozer optimizes a sample-wise weight vector for the representations capturing the disparities in projections originating from different groups. We experimentally demonstrate that Backdozer can attain \\(100\\% \\) accuracy in detecting backdoors. We also evaluate its effectiveness against three closely related state-of-the-art defenses.",
      "authors": [
        "Yue Wang",
        "Wenqing Li",
        "Manaar Alam",
        "Michail Maniatakos",
        "Saif Eddin Jabari"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3639828",
      "keywords": [
        "Autonomous Vehicle",
        "Deep Reinforcement Learning",
        "Backdoor Attacks",
        "Deep Neural Networks"
      ],
      "number_of_pages": null,
      "pages": null,
      "publication": {
        "category": null,
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "ACM J. Auton. Transport. Syst."
      },
      "publication_date": "2024-01-08",
      "selected": null,
      "title": "Backdozer: A Backdoor Detection Methodology for DRL-based Traffic Controllers",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3639828"
      ]
    },
    {
      "abstract": "Perform a list of analyses on the performance, quality of decisions following environment changes, and optimization required for efficiently deploying the MARL model.",
      "authors": [
        "Hani Sami",
        "Rabeb Mizouni",
        "Hadi Otrok",
        "Shakti Singh",
        "Jamal Bentahar",
        "Azzam Mourad"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.future.2023.09.012",
      "keywords": [
        "Trust",
        "Blockchain",
        "Transparency",
        "Vehicular edge computing",
        "Reinforcement learning",
        "Ethereum",
        "Quorum",
        "Cooperative artificial intelligence (AI)"
      ],
      "number_of_pages": 17,
      "pages": "255-271",
      "publication": {
        "category": "Journal",
        "cite_score": 21.1,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0167-739X",
        "publisher": "Elsevier B.V.",
        "sjr": 2.043,
        "snip": 2.584,
        "subject_areas": [
          "Computer Networks and Communications",
          "Hardware and Architecture",
          "Software"
        ],
        "title": "Future Gener. Comput. Syst."
      },
      "publication_date": "2024-01-01",
      "selected": null,
      "title": "LearnChain: Transparent and cooperative reinforcement learning on Blockchain",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.future.2023.09.012"
      ]
    },
    {
      "abstract": "This paper studies the constrained distributed resource allocation problems (DRAPs) of autonomous multi-agent systems (MASs). Unlike well-defined DRAPs, the disturbed second-order agents are taken into account. Moreover, all agents' decisions are subject to both coupling and local inequalities. Because of the coexistence of disturbed second-order nonlinear dynamics and inequality constraints, existing strategies are not applicable to tackle our problem. Also, they create challenges for the strategy design, because the inequality constraints must hold at the optimal allocation (OA), while these agents are not able to control their decisions directly. By gradient descent, state feedback and internal model (IM), we exploit a distributed strategy to control all agents to carry out the distributed resource allocation tasks (DRATs). Furthermore, the strategy is rigorously analyzed. Finally, our strategy is applied to the economic dispatch problems (EDPs). Under our approach, turbine-generators can autonomously achieve the optimal generation allocation by regulating their powers, in accordance with the load demand of smart grids.",
      "authors": [
        "Zhenhua Deng",
        "Jin Luo",
        "Tao Chen"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.ins.2023.119754",
      "keywords": [
        "Inequality constraints",
        "Resource allocation",
        "Internal model",
        "Second-order nonlinear multi-agent systems",
        "Distributed algorithms",
        "Cyber-physical systems"
      ],
      "number_of_pages": 14,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 13.4,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0020-0255",
        "publisher": "Elsevier Inc.",
        "sjr": 2.285,
        "snip": 2.454,
        "subject_areas": [
          "Information Systems and Management",
          "Control and Systems Engineering",
          "Computer Science Applications",
          "Theoretical Computer Science",
          "Software",
          "Artificial Intelligence"
        ],
        "title": "Inf. Sci."
      },
      "publication_date": "2024-01-01",
      "selected": null,
      "title": "Distributed strategy for constrained resource allocation problems of autonomous second-order nonlinear agents and its application to smart grids",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.ins.2023.119754"
      ]
    },
    {
      "abstract": "Dynamic path planning has gained increasing popularity in mobile robot navigation. Some of the current path planning methods require a priori information about the motion space and are easily affected by the distribution of obstacles. To address the above limitation, this paper presents a novel dynamic method that transforms path planning into an optimal control problem and solves it dynamically through adaptive dynamic programming and artificial potential field. The proposed method can obtain optimal paths for a differentially-driven mobile robot model in an unknown environment with many irregular obstacles. First, by combining path optimization and kinematical constraints of the mobile robot, the original problem is transformed into a new problem. Second, the total distance traveled, the effect of heading angle, the distance from the target to the robot, and the resultant force of the artificial potential field are included in the new performance index function. Third, the method based on adaptive dynamic programming is developed to avoid obstacles and guarantee the safety of autonomous navigation. The convergence analysis provides theoretical guarantees for our method, and the iterative control sequence will converge to the optimal control. Furthermore, simulation results and analyses under different complexity levels demonstrate that our method has promising performance in exploring and exploiting dynamic path planning problems.",
      "authors": [
        "Xin Li",
        "Lei Wang",
        "Yi An",
        "Qi-Li Huang",
        "Yun-Hao Cui",
        "Huo-Sheng Hu"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.eswa.2023.121112",
      "keywords": [
        "Path planning",
        "Adaptive dynamic programming",
        "Artificial potential field",
        "Differentially-driven mobile robot",
        "Optimal control"
      ],
      "number_of_pages": 13,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 12.6,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0957-4174",
        "publisher": "Elsevier Ltd.",
        "sjr": 1.873,
        "snip": 2.582,
        "subject_areas": [
          "Computer Science Applications",
          "Engineering (all)",
          "Artificial Intelligence"
        ],
        "title": "Expert Syst. Appl."
      },
      "publication_date": "2024-01-01",
      "selected": null,
      "title": "Dynamic path planning of mobile robots using adaptive dynamic programming",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.eswa.2023.121112"
      ]
    }
  ],
  "processed_at": "2024-01-25 12:21:05",
  "publication_types": [
    "journal",
    "conference proceedings"
  ],
  "query": "(([autonomous] OR [self driving] OR [driverless] OR [unmanned] OR [automated]) AND ([vehicle*] OR [car*] OR [drone*] OR [robot*]) AND ([attack*] OR [exploit*] OR [threat*] OR [adversarial]))",
  "since": "2024-01-01",
  "until": null
}