{
  "databases": [
    "acm"
  ],
  "limit": null,
  "limit_per_database": null,
  "number_of_papers": 74,
  "number_of_papers_by_database": {
    "ACM": 74
  },
  "papers": [
    {
      "abstract": "The expectation of spreading autonomous vehicles lies in the hope of significantly decreasing the 1,3 million death toll accidents worldwide, which are caused by human factor 90% of the time. In policies of insurance companies the reaction time of a ",
      "authors": [
        "Kiss, Gabor"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.3233/JIFS-179671",
      "keywords": [
        "external manipulation",
        "Manchurian AI",
        "self-driving car",
        "autonomous vehicle"
      ],
      "number_of_pages": 5,
      "pages": "5841-5845",
      "publication": {
        "category": "Journal",
        "cite_score": 3.6,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "1064-1246",
        "publisher": "IOS Press BV",
        "sjr": 0.372,
        "snip": 0.638,
        "subject_areas": [
          "Artificial Intelligence",
          "Engineering (all)",
          "Statistics and Probability"
        ],
        "title": "Journal of Intelligent & Fuzzy Systems"
      },
      "publication_date": "2020-01-01",
      "selected": null,
      "title": "Manchurian artificial intelligence in autonomous vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.3233/JIFS-179671",
        "https://content.iospress.com:443/download/journal-of-intelligent-and-fuzzy-systems/ifs179671?id=journal-of-intelligent-and-fuzzy-systems%2Fifs179671"
      ]
    },
    {
      "abstract": "The growing use of wireless technology in healthcare systems and devices makes these systems particularly open to cyber-based attacks, including denial of service and information theft via sniffing (eaves-dropping) and phishing attacks. Evolving technology enables wireless healthcare systems to communicate over longer ranges, which opens them up to greater numbers of possible threats. Unmanned aerial vehicles (UAV) or drones present a new and evolving attack surface for compromising wireless healthcare systems. An enumeration of the types of wireless attacks capable via drones are presented, including two new types of cyber threats: a stepping stone attack and a cloud-enabled attack. A real UAV is developed to test and demonstrate the vulnerabilities of healthcare systems to this new threat vector. The UAV successfully attacked a simulated smart hospital environment and also a small collection of wearable healthcare sensors. Compromise of wearable or implanted medical devices can lead to increased morbidity and mortality.",
      "authors": [
        "Sethuraman, Sibi Chakkaravarthy",
        "Vijayakumar, Vaidehi",
        "Walczak, Steven"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/s10916-019-1489-9",
      "keywords": [
        "Cyber threats",
        "Implantable medical device (IMD)",
        "Body area network (BAN)",
        "Drone",
        "Mobile healthcare",
        "Unmanned aerial vehicle (UAV)"
      ],
      "number_of_pages": 10,
      "pages": "",
      "publication": {
        "category": "Journal",
        "cite_score": 11.8,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0148-5598",
        "publisher": "Springer New York",
        "sjr": 0.914,
        "snip": 1.529,
        "subject_areas": [
          "Medicine (miscellaneous)",
          "Information Systems",
          "Health Information Management",
          "Health Informatics"
        ],
        "title": "Journal of Medical Systems"
      },
      "publication_date": "2019-12-14",
      "selected": null,
      "title": "Cyber Attacks on Healthcare Devices Using Unmanned Aerial Vehicles",
      "urls": [
        "https://link.springer.com/content/pdf/10.1007/s10916-019-1489-9.pdf",
        "https://dl.acm.org/doi/10.1007/s10916-019-1489-9"
      ]
    },
    {
      "abstract": "Object detection plays an important role in the field of self-driving. Illumination has a great impact on object detection, but most of the current methods do not solve the problem of object detection in poor light environment well. We propose a network that can optimize the image conversion which is based on the Cycle Generative Adversarial Networks (CycleGAN). We redesign the discriminator network of Cycle-GAN, add additional discriminators, optimize multiple parts of the network such as loss functions, and add object detection networks after converting the network. The Robot Car dataset of Oxford University is utilized to verify the effectiveness of the proposed method, and the results proved that our method can significantly improve the detection accuracy and increase the detected object number in low illumination environment.",
      "authors": [
        "Yangyang Qu",
        "Yongsheng Ou",
        "Rong Xiong"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ROBIO49542.2019.8961471",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "1738-1743",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE International Conference on Robotics and Biomimetics (ROBIO)"
      },
      "publication_date": "2019-12-01",
      "selected": null,
      "title": "Low Illumination Enhancement For Object Detection In Self-Driving *",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ROBIO49542.2019.8961471"
      ]
    },
    {
      "abstract": "Recent trends in optical transport networks emphasize the need of adopting a self-driving network in order to operate autonomously and adaptively to the actual network environment. In this context, advances in real-time telemetry platforms allowing to continuously monitor the current performance of an optical channel can avoid the traditional provisioning with end-of-life (EoL) margins, which is characterized by imposing margins large enough to account for worst-case performance degradation profiles (e.g. due to ageing) during network operation. Reducing these margins when provisioning an optical channel, can enable to operate it at higher capacity (e.g. using a higher order modulation format), thereby decreasing capital expenditures (CapEx). However, effectively adopting a more aggressive provisioning strategy requires a sophisticated multi-layer framework to address the higher likelihood that traffic demands might have a longer time to live than that of the optical channel carrying them. This paper exploits the joint availability of real-time performance monitoring platforms and OTN switching technology in order to develop a complete framework to provision services with reduced margins while proactively minimizing the utilization of optical channels that are approaching the performance limit, preventing traffic disruption. The simulation results highlight the benefits of adopting the proposed framework regarding the overall network performance and line interface count.",
      "authors": [
        "Daniela Moniz",
        "Joao Pedro",
        "Joao Pires"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/GLOBECOM38437.2019.9013474",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "1-6",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Global Communications Conference (GLOBECOM)"
      },
      "publication_date": "2019-12-01",
      "selected": null,
      "title": "Multi-Layer Network Optimization Efficiently Exploiting Real-Time Performance Monitoring",
      "urls": [
        "https://dl.acm.org/doi/10.1109/GLOBECOM38437.2019.9013474"
      ]
    },
    {
      "abstract": "Mutually beneficial behavior in repeated games can be enforced via the threat of punishment, as enshrined in game theory’s well-known “folk theorem.” There is a cost, however, to a player for generating these disincentives. In this work, we seek to...",
      "authors": [
        "Cooper, Matt",
        "Lee, Jun Ki",
        "Beck, Jacob",
        "Fishman, Joshua D.",
        "Gillett, Michael",
        "Papakipos, Zoë",
        "Zhang, Aaron",
        "Ramos, Jerome",
        "Shah, Aansh",
        "Littman, Michael L."
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-35888-4_34",
      "keywords": [
        "Autonomous driving",
        "Social robots",
        "Algorithmic game theory",
        "Human-agent interaction",
        "Behavior and control"
      ],
      "number_of_pages": 10,
      "pages": "368-377",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-35887-7",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "Social Robotics: 11th International Conference, ICSR 2019, Madrid, Spain, November 26–29, 2019, Proceedings"
      },
      "publication_date": "2019-11-26",
      "selected": null,
      "title": "Stackelberg Punishment and Bully-Proofing Autonomous Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1007/978-3-030-35888-4_34",
        "https://link.springer.com/content/pdf/10.1007/978-3-030-35888-4_34.pdf"
      ]
    },
    {
      "abstract": "The transportation sector is on the threshold of a revolution as advances in real-time communication, real-time computing, and sensing technologies have brought to fruition the capability to build Transportation Cyber-Physical Systems (TCPS) such as self-driving cars, unmanned aerial vehicles, adaptive cruise control systems, truck platoons, and so on. While there are many benefits that TCPSs have to offer, a major challenge that needs to be addressed to enable their proliferation is their vulnerability to cyber attacks. In this article, we demonstrate, using laboratory prototypes of TCPSs, how the approach of Dynamic Watermarking can secure them from arbitrary sensor attacks. Specifically, we consider two TCPSs of topical interest: (i) an adaptive cruise control system and (ii) a system of self-driving vehicles tracking given trajectories. In each of these systems, we first show how cyber attacks on sensors can compromise safety and cause collisions between vehicles in spite of the presence of a collision avoidance module in the system. We then apply the approach of Dynamic Watermarking and demonstrate that it detects attacks with “low” delay. Once an attack is detected, the controller can take appropriate control actions to prevent collisions, thereby guaranteeing safety in the sense of collision freedom.",
      "authors": [
        "Woo-Hyun Ko",
        "Bharadwaj Satchidanandan",
        "P. R. Kumar"
      ],
      "categories": null,
      "citations": 10,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3361700",
      "keywords": [
        "Cyber-physical systems",
        "Autonomous transportation systems",
        "cybersecurity",
        "driver assist systems",
        "secure control",
        "intelligent transportation systems",
        "Dynamic Watermarking"
      ],
      "number_of_pages": 21,
      "pages": "1-21",
      "publication": {
        "category": "Journal",
        "cite_score": 5.8,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "2378-962X",
        "publisher": "Association for Computing Machinery (ACM)",
        "sjr": 0.948,
        "snip": 1.197,
        "subject_areas": [
          "Artificial Intelligence",
          "Computer Networks and Communications",
          "Control and Optimization",
          "Hardware and Architecture",
          "Human-Computer Interaction"
        ],
        "title": "ACM Trans. Cyber-Phys. Syst."
      },
      "publication_date": "2019-11-15",
      "selected": null,
      "title": "Dynamic Watermarking-based Defense of Transportation Cyber-physical Systems",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3361700"
      ]
    },
    {
      "abstract": "Recently Adversarial Examples (AEs) that deceive deep learning models have been a topic of intense research interest. Compared with the AEs in the digital space, the physical adversarial attack is considered as a more severe threat to the applications like face recognition in authentication, objection detection in autonomous driving cars, etc. In particular, deceiving the object detectors practically, is more challenging since the relative position between the object and the detector may keep changing. Existing works attacking object detectors are still very limited in various scenarios, e.g., varying distance and angles, etc. In this paper, we presented systematic solutions to build robust and practical AEs against real world object detectors. Particularly, for Hiding Attack (HA), we proposed thefeature-interference reinforcement (FIR) method and theenhanced realistic constraints generation (ERG) to enhance robustness, and for Appearing Attack (AA), we proposed thenested-AE, which combines two AEs together to attack object detectors in both long and short distance. We also designed diverse styles of AEs to make AA more surreptitious. Evaluation results show that our AEs can attack the state-of-the-art real-time object detectors (i.e., YOLO V3 and faster-RCNN) at the success rate up to 92.4% with varying distance from 1m to 25m and angles from -60º to 60º. Our AEs are also demonstrated to be highly transferable, capable of attacking another three state-of-the-art black-box models with high success rate.",
      "authors": [
        "Yue Zhao",
        "Hong Zhu",
        "Ruigang Liang",
        "Qintao Shen",
        "Shengzhi Zhang",
        "Kai Chen"
      ],
      "categories": null,
      "citations": 59,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3319535.3354259",
      "keywords": [
        "neural networks",
        "physical adversarial attack",
        "object detectors"
      ],
      "number_of_pages": 16,
      "pages": "1989-2004",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450367479",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security"
      },
      "publication_date": "2019-11-06",
      "selected": null,
      "title": "Seeing isn't Believing: Towards More Robust Adversarial Attack Against Real World Object Detectors",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3319535.3354259"
      ]
    },
    {
      "abstract": "In this paper we propose a novel semantic localization algorithm that exploits multiple sensors and has precision on the order of a few centimeters. Our approach does not require detailed knowledge about the appearance of the world, and our maps require orders of magnitude less storage than maps utilized by traditional geometry- and LiDAR intensity-based localizers. This is important as self-driving cars need to operate in large environments. Towards this goal, we formulate the problem in a Bayesian filtering framework, and exploit lanes, traffic signs, as well as vehicle dynamics to localize robustly with respect to a sparse semantic map. We validate the effectiveness of our method on a new highway dataset consisting of 312km of roads. Our experiments show that the proposed approach is able to achieve 0.05m lateral accuracy and 1.12m longitudinal accuracy on average while taking up only 0.3&#x0025; of the storage required by previous LiDAR intensity-based approaches.",
      "authors": [
        "Wei-Chiu Ma",
        "Raquel Urtasun",
        "Ignacio Tartavull",
        "Ioan Andrei Bârsan",
        "Shenlong Wang",
        "Min Bai",
        "Gellert Mattyus",
        "Namdar Homayounfar",
        "Shrinidhi Kowshika Lakshmikanth",
        "Andrei Pokrovsky"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IROS40897.2019.8968122",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "5304-5311",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)"
      },
      "publication_date": "2019-11-01",
      "selected": null,
      "title": "Exploiting Sparse Semantic HD Maps for Self-Driving Vehicle Localization",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IROS40897.2019.8968122"
      ]
    },
    {
      "abstract": "Deep neural networks (DNNs) are being incorporated into various autonomous systems like self-driving cars and robots. However, there is a rising concern about the robustness of these systems because of their susceptibility to adversarial attacks on DNNs. Past research has established that DNNs used for classification and object detection are prone to attacks causing targeted misclassification. In this paper, we show the effectiveness of an adversarial dynamic attack on an end-to-end trained DNN controlling an autonomous vehicle. We launch the attack by installing a billboard on the roadside and displaying videos to approaching vehicles to cause the DNN controller in the vehicle to generate steering commands that cause, for example, unintended lane changes or motion off the road causing accidents. The billboard has an integrated camera estimating the pose of the on-coming vehicle. The approach enables dynamic adversarial perturbation that adapts to the relative pose of the vehicle and uses the dynamics of the vehicle to steer it along adversary-chosen trajectories while being robust to variations in view, lighting, and weather. We demonstrate the effectiveness of the attack on a recently published off-the-shelf end-to-end learning-based autonomous navigation system in a high-fidelity simulator, CARLA (CAR Learning to Act). The proposed approach may also be applied to other systems driven by an end-to-end trained network.",
      "authors": [
        "Naman Patel",
        "Prashanth Krishnamurthy",
        "Siddharth Garg",
        "Farshad Khorrami"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IROS40897.2019.8968267",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "5916-5921",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)"
      },
      "publication_date": "2019-11-01",
      "selected": null,
      "title": "Adaptive Adversarial Videos on Roadside Billboards: Dynamically Modifying Trajectories of Autonomous Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IROS40897.2019.8968267"
      ]
    },
    {
      "abstract": "\n\nUnmanned Aerial Vehicles (UAVs), such as tethered drones, become increasingly popular for video acquisition, within video surveillance or remote, scientific measurement contexts. However, UAV recordings often present an unstable, variable viewpoint that is...",
      "authors": [
        "Lemaire, Pierre",
        "Crispim-Junior, Carlos Fernando",
        "Robinault, Lionel",
        "Tougne, Laure"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-33720-9_41",
      "keywords": [
        "Motion estimation",
        "Unmanned Aerial Vehicles",
        "Video stabilization",
        "Video registration"
      ],
      "number_of_pages": 11,
      "pages": "529-539",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-33719-3",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "Advances in Visual Computing: 14th International Symposium on Visual Computing, ISVC 2019, Lake Tahoe, NV, USA, October 7–9, 2019, Proceedings, Part I"
      },
      "publication_date": "2019-10-07",
      "selected": null,
      "title": "Jitter-Free Registration for Unmanned Aerial Vehicle Videos",
      "urls": [
        "https://link.springer.com/content/pdf/10.1007/978-3-030-33720-9_41.pdf",
        "https://dl.acm.org/doi/10.1007/978-3-030-33720-9_41"
      ]
    },
    {
      "abstract": "Understanding traffic signs is one of the basic requirements for a self-driving car to drive autonomously in real world scenario. It needs to be able to achieve this task with an error rate similar or lower than a human. Currently, in the automotive industry, most vision based algorithms still rely heavily on the geometry and color of traffic signs to detect and classify them. Although these approaches are suitable for highway scenario where there is not much background objects, they are not robust enough to handle the vast and diverse amount of objects that can be found in urban scenario. Inspired by the performance achieved by Convolutional Neural Network (CNN) based object detector, we would like to investigate the feasibility of using CNN for the task of traffic sign detection from camera images.In this paper, we will be focusing on two specific issues of our task, the low interclass variation of traffic signs and the small size of the traffic signs in images. To tackle these issues, we propose a new architecture that splits the detection and classification branches of a CNN based object detector. This architecture exploits low level features for classification while it uses high level features for detection in a single forward pass. With this modification, we were able to improve the average precision of the detection results by 5% to 19% on public datasets.",
      "authors": [
        "Ee Heng Chen",
        "Philipp Röthig",
        "Jöran Zeisler",
        "Darius Burschka"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ITSC.2019.8917340",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "325-332",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Intelligent Transportation Systems Conference (ITSC)"
      },
      "publication_date": "2019-10-01",
      "selected": null,
      "title": "Investigating Low Level Features in CNN for Traffic Sign Detection and Recognition",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ITSC.2019.8917340"
      ]
    },
    {
      "abstract": "A growing presence of mobile agents is envisaged in the smart factories scenario of the next future. The safe motion of traditional Automated Guided Vehicles in human-shared workspaces can be achieved thanks to the support of a fleet of Autonomous Mobile Robots, acting as a net of meta-sensors, able to detect the human presence and share the information. This paper proposes a preliminary working implementation of one meta-sensor module, exploiting the synergistic use of different sensors through an overall affordable and accessible sensor data fusion algorithm. Experimental results in a laboratory environment confirm the validity of the approach.",
      "authors": [
        "Marina Indri",
        "Fiorella Sibona",
        "Pangcheng David Cen Cheng"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IECON.2019.8927622",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "738-743",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "IECON 2019 - 45th Annual Conference of the IEEE Industrial Electronics Society"
      },
      "publication_date": "2019-10-01",
      "selected": null,
      "title": "Sensor data fusion for smart AMRs in human-shared industrial workspaces",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IECON.2019.8927622"
      ]
    },
    {
      "abstract": "This video demonstrates the proposed Super Wing (S.Wing), a self-driving modular transportation system that provides children the opportunity to travel by themselves. The safety of children in vehicles is often threatened by distracted driving behaviors. With the on-demand S.Wing system, a child can travel by themselves based on the mutual needs of the parents and the child. S.Wing includes a supervision service by having a certified attendant with the child on-board. This ensures that the child's seat belt is safely fastened and help can be provided immediately. Modular S.Wing pod is ordered by an adult through a mobile application and offers the opportunity for the adult to monitor and interact with their child via live video streaming. The system has the potential to improve children's safety while they are on the road and allow them to engage in social and school-related activities without relying on adults for transportation.",
      "authors": [
        "Haena Kim",
        "Auður Anna Jónsdóttir",
        "Jai Shankar",
        "Linda Ng Boyle"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3349263.3349605",
      "keywords": [
        "children safety",
        "safe transport",
        "on-demand mobility",
        "automated transport"
      ],
      "number_of_pages": 3,
      "pages": "472-474",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450369206",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings"
      },
      "publication_date": "2019-09-21",
      "selected": null,
      "title": "S.Wing: a shared on-demand transportation network system for children",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3349263.3349605"
      ]
    },
    {
      "abstract": "Autonomous systems will soon be integrating into our lives as home assistants, delivery drones, and driverless cars. The implementation of the level of automation in these systems from being manually controlled to fully autonomous would depend upon the autonomy approach chosen to design these systems. This article reviews the historical evolution of autonomy, its approaches, and the current trends in related fields to build robust autonomous systems. Toward such a goal and with the increased number of cyberattacks, the security of these systems needs special attention from the research community. To gauge the extent to which research has been done in this area, we discuss the cybersecurity of these systems. It is essential to model the system from a security perspective, identify the threats and vulnerabilities, and then model the attacks. A survey in this direction explores the theoretical/analytical system and attack models that have been proposed over the years and identifies the research gap that needs to be addressed by the research community.",
      "authors": [
        "Farha Jahan",
        "Weiqing Sun",
        "Quamar Niyaz",
        "Mansoor Alam"
      ],
      "categories": null,
      "citations": 30,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3337791",
      "keywords": [
        "modeling",
        "Unmanned Aerial Vehicles (UAVs)",
        "autonomous system (AS)",
        "robots",
        "driverless car",
        "Cybersecurity"
      ],
      "number_of_pages": 34,
      "pages": "1-34",
      "publication": {
        "category": "Journal",
        "cite_score": 28.5,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0360-0300",
        "publisher": "Association for Computing Machinery (ACM)",
        "sjr": 4.457,
        "snip": 7.155,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "ACM Comput. Surv."
      },
      "publication_date": "2019-09-13",
      "selected": null,
      "title": "Security Modeling of Autonomous Systems: A Survey",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3337791"
      ]
    },
    {
      "abstract": "Autonomous cyber-physical systems are systems that combine the physics of motion with advanced cyber algorithms to act on their own without close human supervision. The present consensus is that reasonable levels of autonomy, such as for self-driving cars or...",
      "authors": [
        "Platzer, André"
      ],
      "categories": null,
      "citations": 3,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-30281-8_2",
      "keywords": [
        "Hybrid systems",
        "Autonomous cyber-physical systems",
        "Formal verification",
        "Differential dynamic logic",
        "Safe AI",
        "Runtime verification"
      ],
      "number_of_pages": 9,
      "pages": "25-33",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-30280-1",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "Quantitative Evaluation of Systems: 16th International Conference, QEST 2019, Glasgow, UK, September 10–12, 2019, Proceedings"
      },
      "publication_date": "2019-09-10",
      "selected": null,
      "title": "The Logical Path to Autonomous Cyber-Physical Systems",
      "urls": [
        "https://dl.acm.org/doi/10.1007/978-3-030-30281-8_2",
        "https://link.springer.com/content/pdf/10.1007/978-3-030-30281-8_2.pdf"
      ]
    },
    {
      "abstract": "Recent advances in artificial intelligence have increased the importance of security issues. Nowadays, deep neural networks (DNNs) are used in many critical applications such as pilot drones and self-driving cars. So, the DNN's malfunction, due to an attack, may cause irreparable damages. The attack may happen either in training phase (poisoning attacks) or testing phase (evasion attacks) by presenting adversarial examples. These samples are maliciously created to deceive DNNs. This paper deals with evasion attacks and aims to immunize DNNs through adversarial examples generation and training. We propose Noise-GAN, a Generative Adversarial Network (GAN) with a multi-class Discriminator for producing a noise that by adding it to the original image adversarial examples can be obtained. In this paper, various types of evasion attacks are considered and performance of the proposed method is evaluated on different victim models under various defensive strategies. Experimental results are based on MNIST and CIFAR10 datasets and the average success rates for different attacks are reported and compared with state-of-the-art methods. The Non-targeted attack success rates on DNNs after training by adversarial examples, generated by Noise-GAN, were declined from 87.7% to 10.41% using MNIST dataset and from 91.2% to 57.66% using CIFAR-10 dataset.",
      "authors": [
        "Atiye Sadat Hashemi",
        "Saeed Mozaffari"
      ],
      "categories": null,
      "citations": 5,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1016/j.cose.2019.06.012",
      "keywords": [
        "Adversarial example generation",
        "Security of deep neural networks",
        "GAN",
        "Adversarial example training",
        "Evasion attack"
      ],
      "number_of_pages": 16,
      "pages": "372-387",
      "publication": {
        "category": "Journal",
        "cite_score": 11.1,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0167-4048",
        "publisher": "Elsevier Ltd.",
        "sjr": 1.605,
        "snip": 2.232,
        "subject_areas": [
          "Computer Science (all)",
          "Law"
        ],
        "title": "Comput. Secur."
      },
      "publication_date": "2019-09-01",
      "selected": null,
      "title": "Secure deep neural networks using adversarial image generation and training with Noise-GAN",
      "urls": [
        "https://dl.acm.org/doi/10.1016/j.cose.2019.06.012"
      ]
    },
    {
      "abstract": "\nObject detectors, such as Faster R-CNN and YOLO, have numerous applications, including in some critical systems, e.g., self-driving cars and unmanned aerial vehicles. Their vulnerabilities have to be studied thoroughly before deploying them in critical systems to...",
      "authors": [
        "Huang, Yi",
        "Kong, Adams Wai-Kin",
        "Lam, Kwok-Yan"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-29894-4_1",
      "keywords": [
        "Adversarial examples",
        "Attack",
        "Object detection"
      ],
      "number_of_pages": 13,
      "pages": "3-15",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-29893-7",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "PRICAI 2019: Trends in Artificial Intelligence: 16th Pacific Rim International Conference on Artificial Intelligence, Cuvu, Yanuca Island, Fiji, August 26-30, 2019, Proceedings, Part III"
      },
      "publication_date": "2019-08-26",
      "selected": null,
      "title": "Attacking Object Detectors Without Changing the Target Object",
      "urls": [
        "https://dl.acm.org/doi/10.1007/978-3-030-29894-4_1",
        "https://link.springer.com/content/pdf/10.1007/978-3-030-29894-4_1.pdf"
      ]
    },
    {
      "abstract": "Deep learning has made headlines in the past few years due to successes in tasks, such as self-driving vehicles and board games, which were previously thought difficult or impossible. The successes have generated much interest in artificial intelligence among researchers and members of the public. However, deep learning algorithms generally require very large labelled data sets to work well and large labelled data sets are not always readily available. In addition, most machine learning techniques, including deep learning, often perform well statistically but can fail miserably when, for example, data are deliberately perturbed in an adversarial attack. Another criticism of deep learning techniques is a relative lack of explainability. This paper proposes the use of intentional learning to simultaneously address these issues. Preliminary evaluation on the MNIST data set has shown promising results. Specifically, by combing extensional and intensional learning, it is possible to achieve similar accuracy result as extensional learning only using only one-sixth of the original training data set.",
      "authors": [
        "A. C.M. Fong",
        "Guanyue Hong"
      ],
      "categories": null,
      "citations": 5,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3355402.3355406",
      "keywords": [
        "intension and extension of concepts",
        "neural networks",
        "Machine learning paradigms",
        "ontologies"
      ],
      "number_of_pages": 6,
      "pages": "18-23",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450372282",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2019 International Conference on Information Technology and Computer Communications"
      },
      "publication_date": "2019-08-16",
      "selected": null,
      "title": "Ontology-Powered Hybrid Extensional-Intensional Learning",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3355402.3355406"
      ]
    },
    {
      "abstract": "In this paper, we present a review of the state of the art in the context of the human-drone interaction, so as to study and discuss the main open issues and challenges currently highlighted and reported in research projects and papers available in the current literature.",
      "authors": [
        "Silvia Mirri",
        "Catia Prandi",
        "Paola Salomoni"
      ],
      "categories": null,
      "citations": 26,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3341568.3342111",
      "keywords": [
        "Drones",
        "HCI",
        "UAVs",
        "Human-Drone Interaction"
      ],
      "number_of_pages": 6,
      "pages": "43-48",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450368797",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the ACM SIGCOMM 2019 Workshop on Mobile AirGround Edge Computing, Systems, Networks, and Applications"
      },
      "publication_date": "2019-08-14",
      "selected": null,
      "title": "Human-Drone Interaction: state of the art, open issues and challenges",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3341568.3342111"
      ]
    },
    {
      "abstract": "Computing systems are becoming ever more complex, with decisions increasingly often based on deep learning components. A wide variety of applications are being developed, many of them safety-critical, such as self-driving cars and medical diagnosis. Since deep learning is unstable with respect to adversarial perturbations, there is a need for rigorous software development methodologies that encompass machine learning components. This lecture will describe progress with developing automated verification and testing techniques for deep neural networks to ensure safety and robustness of their decisions with respect to input perturbations. The techniques exploit Lipschitz continuity of the networks and aim to approximate, for a given set of inputs, the reachable set of network outputs in terms of lower and upper bounds, in anytime manner, with provable guarantees. We develop novel algorithms based on feature-guided search, games, global optimisation and Bayesian methods, and evaluate them on state-of-the-art networks. The lecture will conclude with an overview of the challenges in this field.",
      "authors": [
        "Marta Kwiatkowska"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3338906.3342812",
      "keywords": [
        "Deep Neural Networks",
        "Automated Verification",
        "Adversarial Examples"
      ],
      "number_of_pages": 1,
      "pages": "2",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450355728",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2019 27th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"
      },
      "publication_date": "2019-08-12",
      "selected": null,
      "title": "Safety and robustness for deep learning with provable guarantees (keynote)",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3338906.3342812"
      ]
    },
    {
      "abstract": "With the growing number of research studies on autonomous driving, a lot of new technologies for self-driving cars are also constantly emerging. While significantly promoting the development of autonomous vehicles, these emerging technologies also have potential vulnerabilities, which may bring up some nonnegligible security threats. Loopholes existing in localization and navigation technologies, which are the key elements of route planning and navigation, could be utilized by adversaries to manipulate autonomous driving navigation by hijacking valuable vehicles, goods, or even target characters. Toward this end, we provide in this article a basic guide summarizing the security threats and attack schemes, and we propose countermeasures specifically for localization and navigation technologies in autonomous vehicles. After that, we present a novel route spoofing attack that could also be implemented against future autonomous driving navigation. With such implementation, we demonstrate that effectively, routes of targeted drivers can be usurped and hence mislead drivers to take a wrong route, go by a malicious place, and even be tracked in real time.",
      "authors": [
        "Qian Luo",
        "Yurui Cao",
        "Jiajia Liu",
        "Abderrahim Benslimane"
      ],
      "categories": null,
      "citations": 9,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/MWC.2019.1800533",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "38-45",
      "publication": {
        "category": "Journal",
        "cite_score": 26.0,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "1536-1284",
        "publisher": "Institute of Electrical and Electronics Engineers Inc.",
        "sjr": 6.556,
        "snip": 3.62,
        "subject_areas": [
          "Electrical and Electronic Engineering",
          "Computer Science Applications"
        ],
        "title": "Wireless Commun."
      },
      "publication_date": "2019-08-01",
      "selected": null,
      "title": "Localization and Navigation in Autonomous Driving: Threats and Countermeasures",
      "urls": [
        "https://dl.acm.org/doi/10.1109/MWC.2019.1800533"
      ]
    },
    {
      "abstract": "For ensuring safety and for handling emergency situations, most autonomous vehicles use remote human operators by communicating the road condition captured using LiDAR (Light Detection and Ranging) and stereo RGB cameras [10, 11]. Recent research [2, 3] has identified several possible scenarios of forgery attacks during such data communication between autonomous vehicles and human operators. Hence, there is a distinct requirement for forensics research on the multi-modal LiDAR and RGB camera data generated from autonomous vehicles. In this paper, we present a new dataset, ADD-FAR (Attacked Driving Dataset for Forensics Analysis and Research) that contains forged driving scenarios based on KITTI Vision Benchmark Suite [4, 5]. This dataset is created by identifying objects of interest using automated 3D object detection and carrying out the attacks with different levels of risk as defined in [3]. As part of the dataset, we are also providing the scripts used for automatically generating the different types of attacks. These scripts can easily be modified to work with other driving datasets apart from KITTI as well as for creating new forms of attacks.",
      "authors": [
        "Kanchan Bahirat",
        "Nidhi Vaishnav",
        "Sandeep Sukumaran",
        "Balakrishnan Prabhakaran"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3304109.3325817",
      "keywords": [
        "3D forensics",
        "LiDAR",
        "ADAS"
      ],
      "number_of_pages": 6,
      "pages": "243-248",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450362979",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 10th ACM Multimedia Systems Conference"
      },
      "publication_date": "2019-06-18",
      "selected": null,
      "title": "ADD-FAR: attacked driving dataset for forensics analysis and research",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3304109.3325817"
      ]
    },
    {
      "abstract": "While GPS (Global Positioning System) navigation and GPS based autonomous car driving techniques are mature, the security of GPS signal has not been a primary system concern. In fact, it has been shown that an ordinary GPS can be easily spoofed by a low-cost, open-source based software defined radio (SDR) system such as bladeRF and HackRF [3, 4] which can cause serious complications to the navigation system of the car especially for self-driving cars which are driven based on the information from sensors, cameras, and GPS. In this work, we design a new GPS authentication system called lightweight authentication GPS (AuthGPS) to authenticate GPS signal against GPS spoofing and LTE base station broadcast message spoofing. In the past, there have been many successful attempts on GPS spoofing which resulted in shifting the destination of the car to the spoofer's desired location. In a case where the car is connected to the Internet via LTE network, the navigation system can find out if the GPS is spoofed by acquiring the correct GPS satellite information from LTE base stations' location information. However, a skillful attacker can spoof the LTE base station signals [7] as well using another SDR which will produce spoofed LTE base station information. Hence giving wrong information about GPSinformation according to the will of the attacker. Currently, there are defense methods against the GPS spoofing [6]. One of them is signal-processing-based methods. By monitoring unusual or unreasonable signal changes at GPS receivers, GPS spoofing attack can be detected. Received Power Monitoring (RPM) looks at all the received amplitude and automatic gain control (AGC) setpoint [1]. The receiver will sense drastic power jump if a spoofing attack occurs. However, an overly powerful spoofing attack with noise is not detectable in the case of this mechanism. Another way to detect spoofing is the symmetric-key encryption mechanism of GPS signals. According to previous research [2], encrypted precision code for anti-spoofing referred to as P(Y) code, might not be able to be spoofed. A spoofing attack can be detected by calculating cross-correlation between spoofed coarse/acquisition code, referred to as C/A code, and P(Y) code. Unfortunately, this P(Y) code is only for military purpose while the C/A code can be publicly accessible. This method requires knowledge of specific key which is not revealed to the public to decrypt P(Y) code. Monitoring the direction of arrival of the signals can be one of the methods [6]. A GPS receiver measures the direction-of-arrival vector with more than 3 antennas. Even though this signal-geometrybased system with multiple antennas makes GPS robust, an attacker can spoof signals from multiple directions, which is more difficult to detect the spoofing. The idea here is to develop a system that can discriminate the spoofed signal without complex computation or heavy message exchange. An important component of AuthGPS is a verification of valid GPS satellite information via LTE base stations' location information. We propose 6-digit one-time password-based authentication system in this paper.",
      "authors": [
        "Shahroz Tariq",
        "Hoyoung Kim",
        "Jihoon Ryoo"
      ],
      "categories": null,
      "citations": 3,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3307334.3328618",
      "keywords": [
        "LTE authentication",
        "GPS spoofing",
        "mobile and wireless security"
      ],
      "number_of_pages": 2,
      "pages": "547-548",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450366618",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 17th Annual International Conference on Mobile Systems, Applications, and Services"
      },
      "publication_date": "2019-06-12",
      "selected": null,
      "title": "AuthGPS: Lightweight GPS Authentication against GPS and LTE Spoofing (poster)",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3307334.3328618"
      ]
    },
    {
      "abstract": "Considerable progress has been made in semantic scene understanding of road scenes with monocular cameras. It is, however, mainly focused on certain specific classes such as cars, bicyclists and pedestrians. This work investigates traffic cones, an object category crucial for traffic control in the context of autonomous vehicles. 3D object detection using images from a monocular camera is intrinsically an ill-posed problem. In this work, we exploit the unique structure of traffic cones and propose a pipelined approach to solve this problem. Specifically, we first detect cones in images by a modified 2D object detector. Following which the keypoints on a traffic cone are recognized with the help of our deep structural regression network, here, the fact that the cross-ratio is projection invariant is leveraged for network regularization. Finally, the 3D position of cones is recovered via the classical Perspective n-Point algorithm using correspondences obtained from the keypoint regression. Extensive experiments show that our approach can accurately detect traffic cones and estimate their position in the 3D world in real time. The proposed method is also deployed on a real-time, autonomous system. It runs efficiently on the low-power Jetson TX2, providing accurate 3D position estimates, allowing a race-car to map and drive autonomously on an unseen track indicated by traffic cones. With the help of robust and accurate perception, our race-car won both Formula Student Competitions held in Italy and Germany in 2018, cruising at a top speed of 54 km/h on our driverless platform &#x201C;gotthard driverless&#x201D; https://youtu. be/HegmIXASKow?t&#x003D;&#x003D;11694. Visualization of the complete pipeline, mapping and navigation can be found on our project page http://people.ee.ethz.ch/&#x003D;tracczucrich/Trnfflcf.lonc/.",
      "authors": [
        "Ankit Dhall",
        "Dengxin Dai",
        "Luc Van Gool"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2019.8814089",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "494-501",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2019-06-09",
      "selected": null,
      "title": "Real-time 3D Traffic Cone Detection for Autonomous Driving",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2019.8814089"
      ]
    },
    {
      "abstract": "Road-users are a critical part of decision-making for both self-driving cars and driver assistance systems. Some road-users, however, are more important for decision-making than others because of their respective intentions, ego-vehicle&#x0027;s intention and their effects on each other. In this paper, we propose a novel architecture for road-user importance estimation which takes advantage of the local and global context of the scene. For local context, the model exploits the appearance of the road users (which captures orientation, intention, etc.) and their location relative to ego-vehicle. The global context in our model is defined based on the feature map of the convolutional layer of the module which predicts the future path of the ego-vehicle and contains rich global information of the scene (e.g., infrastructure, road lanes, etc.), as well as the ego-vehicle&#x0027;s intention information. Moreover, this paper introduces a new data set of real-world driving, concentrated around intersections and includes annotations of important road users. Systematic evaluations of our proposed method against several baselines show promising results.",
      "authors": [
        "Alireza Rahimpour",
        "Sujitha Martin",
        "Ashish Tawari",
        "Hairong Qi"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2019.8814210",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "2337-2343",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2019-06-09",
      "selected": null,
      "title": "Context Aware Road-user Importance Estimation (iCARE)",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2019.8814210"
      ]
    },
    {
      "abstract": "Increasing interest in deep learning and convolutional neural networks resulted in the last years in multiple techniques aiming to improve their accuracy, training speed, and inference speed. At the same time, their computational cost triggered the design of several dedicated hardware architectures, aiming to handle the elevated number of operations neural networks require with minimal power budget, often exploiting reduced precision arithmetic. In this case study, we analyzed how several techniques can be merged together in the design of a track detector for a self-driving racing car, illustrating a step-by-step procedure required to adapt several theoretical works to a real-world scenario. Compared with the best previous detector, the new Proteins cone detector is optimized for low-precision deep learning accelerators. It runs 50% faster on GPU than the previous detector and at a simulated 272.5 FPS on a 1 W ASIC or at 16.4 FPS on a 12 W FPGA and achieves a detection score 16% higher than the previous implementation.",
      "authors": [
        "Nicolò De Rita",
        "Alessandro Aimar",
        "Tobi Delbruck"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2019.8814001",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "647-652",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2019-06-09",
      "selected": null,
      "title": "CNN-based Object Detection on Low Precision Hardware: Racing Car Case Study",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2019.8814001"
      ]
    },
    {
      "abstract": "Many tasks performed by autonomous vehicles such as road marking detection, object tracking, and path planning are simpler in bird&#x0027;s-eye view. Hence, Inverse Perspective Mapping (IPM) is often applied to remove the perspective effect from a vehicle&#x0027;s front-facing camera and to remap its images into a 2D domain, resulting in a top-down view. Unfortunately, however, this leads to unnatural blurring and stretching of objects at further distance, due to the resolution of the camera, limiting applicability. In this paper, we present an adversarial learning approach for generating a significantly improved IPM from a single camera image in real time. The generated bird&#x0027;seye-view images contain sharper features (e.g, road markings) and a more homogeneous illumination, while (dynamic) objects are automatically removed from the scene, thus revealing the underlying road layout in an improved fashion. We demonstrate our framework using real-world data from the Oxford Robot-Car Dataset and show that scene understanding tasks directly benefit from our boosted IPM approach.",
      "authors": [
        "Tom Bruls",
        "Horia Porav",
        "Lars Kunze",
        "Paul Newman"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2019.8814056",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "302-309",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2019-06-09",
      "selected": null,
      "title": "The Right (Angled) Perspective: Improving the Understanding of Road Scenes Using Boosted Inverse Perspective Mapping",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2019.8814056"
      ]
    },
    {
      "abstract": "Adversarial attacks are small, carefully crafted perturbations, imperceptible to the naked eye; that when added to an image cause deep learning models to misclassify the image with potentially detrimental outcomes. With the rise of artificial intelligence models in consumer safety and security intensive industries such as self-driving cars, camera surveillance and face recognition, there is a growing need for guarding against adversarial attacks. In this paper, we present an approach that uses metamorphic testing principles to automatically detect such adversarial attacks. The approach can detect image manipulations that are so small, that they are impossible to detect by a human through visual inspection. By applying metamorphic relations based on distance ratio preserving affine image transformations which compare the behavior of the original and transformed image; we show that our proposed approach can determine whether or not the input image is adversarial with a high degree of accuracy.",
      "authors": [
        "Rohan Reddy Mekala",
        "Gudjon Einar Magnusson",
        "Adam Porter",
        "Mikael Lindvall",
        "Madeline Diep"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/MET.2019.00016",
      "keywords": [
        "adversarial attacks",
        "machine learning models",
        "neural networks",
        "adversarial detection",
        "metamorphic testing"
      ],
      "number_of_pages": 8,
      "pages": "55-62",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 4th International Workshop on Metamorphic Testing"
      },
      "publication_date": "2019-05-26",
      "selected": null,
      "title": "Metamorphic detection of adversarial examples in deep learning models with affine transformations",
      "urls": [
        "https://dl.acm.org/doi/10.1109/MET.2019.00016"
      ]
    },
    {
      "abstract": "Deep reinforcement learning has recently made significant progress in solving computer games and robotic control tasks. A known problem, though, is that policies overfit to the training environment and may not avoid rare, catastrophic events such as automotive accidents. A classical technique for improving the robustness of reinforcement learning algorithms is to train on a set of randomized environments, but this approach only guards against common situations. Recently, robust adversarial reinforcement learning (RARL) was developed, which allows efficient applications of random and systematic perturbations by a trained adversary. A limitation of RARL is that only the expected control objective is optimized; there is no explicit modeling or optimization of risk. Thus the agents do not consider the probability of catastrophic events (i.e., those inducing abnormally large negative reward), except through their effect on the expected objective. In this paper we introduce risk-averse robust adversarial reinforcement learning (RARARL), using a risk-averse protagonist and a risk-seeking adversary. We test our approach on a self-driving vehicle controller. We use an ensemble of policy networks to model risk as the variance of value functions. We show through experiments that a risk-averse agent is better equipped to handle a risk-seeking adversary, and experiences substantially fewer crashes compared to agents trained without an adversary. Supplementary materials are available at https://sites.google.com/view/rararl.",
      "authors": [
        "Xinlei Pan",
        "Daniel Seita",
        "Yang Gao",
        "John Canny"
      ],
      "categories": null,
      "citations": 3,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ICRA.2019.8794293",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "8522-8528",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 International Conference on Robotics and Automation (ICRA)"
      },
      "publication_date": "2019-05-20",
      "selected": null,
      "title": "Risk Averse Robust Adversarial Reinforcement Learning",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ICRA.2019.8794293"
      ]
    },
    {
      "abstract": "Localizing a vehicle in a map is essential for automated driving and various other robotic applications. This paper addresses the problem of vehicle localization in urban environments. Our approach performs a graph-based sliding window optimization over a set of recent landmark and odometry measurements for fast and accurate vehicle localization on third-party maps. Our work incorporates landmark priors from third-party maps into the estimation problem and shows how to exploit the sliding window formulation for revising data associations. We describe how to construct our factor graph and derive its necessary factors to model the information from the map as a prior over the landmark detections. We implemented our approach on an automated car and thoroughly tested it on real-world data. The experiments suggest that the approach provides highly accurate pose estimates, is fast enough for automated driving applications, and outperforms localization using particle filters.",
      "authors": [
        "Daniel Wilbers",
        "Christian Merfels",
        "Cyrill Stachniss"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ICRA.2019.8793971",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "5951-5957",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 International Conference on Robotics and Automation (ICRA)"
      },
      "publication_date": "2019-05-20",
      "selected": null,
      "title": "Localization with Sliding Window Factor Graphs on Third-Party Maps for Automated Driving",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ICRA.2019.8793971"
      ]
    },
    {
      "abstract": "In recent years self-driving vehicles have become more commonplace on public roads, with the promise of bringing safety and efficiency to modern transportation systems. Increasing the reliability of these vehicles on the road requires an extensive suite of software tests, ideally performed on highfidelity simulators, where multiple vehicles and pedestrians interact with the self-driving vehicle. It is therefore of critical importance to ensure that self-driving software is assessed against a wide range of challenging simulated driving scenarios. The state of the art in driving scenario generation, as adopted by some of the front-runners of the self-driving car industry, still relies on human input [1]. In this paper we propose to automate the process using Bayesian optimization to generate adversarial self-driving scenarios that expose poorly-engineered or poorly-trained self-driving policies, and increase the risk of collision with simulated pedestrians and vehicles. We show that by incorporating the generated scenarios into the training set of the self-driving policy, and by fine-tuning the policy using vision-based imitation learning we obtain safer self-driving behavior.",
      "authors": [
        "Yasasa Abeysirigoonawardena",
        "Florian Shkurti",
        "Gregory Dudek"
      ],
      "categories": null,
      "citations": 4,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ICRA.2019.8793740",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "8271-8277",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 International Conference on Robotics and Automation (ICRA)"
      },
      "publication_date": "2019-05-20",
      "selected": null,
      "title": "Generating Adversarial Driving Scenarios in High-Fidelity Simulators",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ICRA.2019.8793740"
      ]
    },
    {
      "abstract": "Visual Odometry (VO) is an application of computer vision which helps in autonomous navigation of Self-Driving vehicles, Robots etc. The odometry pose of the vehicle can be estimated using the consecutive frames based on monocular or stereo camera setup mounted on the vehicle. The Simultaneous Localization and Mapping (SLAM) based approaches have shown phenomenal results in predicting the vehicle odometry. Deep Learning based approaches are emerging in the field of computer vision and are outperforming other classic algorithms. But, visual odometry is one of the field where deep learning approaches have not yet been exploited largely. This paper proposes the use of Deep Learning based pipeline approach to solve the problem of visual odometry. The paper boosts the performance of deep learning approach by extracting quite more features before training the network. This paper proposes the use of ORB based feature extractor along with Convolutional Neural Network based dimensionality reduction and stacking multiple deep LSTM&#x0027;s for modelling the sequential data. In this case, the KITTI vision Benchmark dataset is used to model the network. The accuracy of the network is examined by calculating the error between the predicted odometry output and the ground truth odometry output. The results are compared with different Convolutional Neural Network (CNN) architectures proposed for the same task. The average translation error from the proposed system is 11.99&#x0025; and the average rotational error from the proposed system is 0.0462 degrees per meter.",
      "authors": [
        "Karthik Sivarama Krishnan",
        "Ferat Sahin"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/SYSOSE.2019.8753848",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "296-301",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 14th Annual Conference System of Systems Engineering (SoSE)"
      },
      "publication_date": "2019-05-19",
      "selected": null,
      "title": "ORBDeepOdometry - A Feature-Based Deep Learning Approach to Monocular Visual Odometry",
      "urls": [
        "https://dl.acm.org/doi/10.1109/SYSOSE.2019.8753848"
      ]
    },
    {
      "abstract": "Unmanned scene recognition means that unmanned vehicles can collect environmental data from equipped sensors and make decisions through algorithms, in which deep learning has become one of key technologies. Especially, with the discovery of adversarial examples against deep learning, the research on offensive and defensive against adversarial examples illustrates that the deep learning model for unmanned scene recognition also has the safety vulnerability. However, as far as we know, few studies have tried to explore the adversarial example attack in this field. Therefore, we try to address this problem by generating adversarial examples againist scene recognition classification model through experiments. In addition, we also try to improve the adversarial model robustness by the adversarial training. Extensive experiments have been conducted, and experimental results show that adversarial examples have an efficient attack effect on the neural network for scene recognition.",
      "authors": [
        "Xuankai Wang",
        "Mi Wen",
        "Jinguo Li",
        "Zipeng Fu",
        "Rongxing Lu",
        "Kefei Chen"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3321408.3321571",
      "keywords": [
        "adversarial examples",
        "unmanned vehicle",
        "scene recognition"
      ],
      "number_of_pages": 6,
      "pages": "1-6",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450371582",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the ACM Turing Celebration Conference - China"
      },
      "publication_date": "2019-05-17",
      "selected": null,
      "title": "Adversarial attack against scene recognition system for unmanned vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3321408.3321571"
      ]
    },
    {
      "abstract": "The continuous link connectivity is critical for the efficient collaboration of multiple unmanned aerial vehicles (UAVs). However, the UAV communication environments are not only harsh, but are also confronted with the threats of smart attackers, which pose great barriers in maintaining the links unblocked. In this paper, we leverage the paradigm of the Generative Adversarial Network (GAN) to formulate an attack-resilient connectivity game between a pair of neighboring UAVs and an attacker. In the three-agent adversary game, the attacker acts as the generator, which attempts to generate highly approximate information as the UAVs so as to maximize its jamming capability; while the pairwise UAVs act as the discriminators, which attempt to enhance the capability of refusing the fake information (i.e., the opponent's attack). As the state-of-the-art GAN learning algorithms suffer from the instability dilemma (i.e., either with the unsuccessful convergence or with the low generation/discrimination performance), we incorporate the conditional GAN with the least square objective loss function as well as the mean square error such that the attacker can improve the detection capability from UAVs' historical activity patterns and the UAVs can accordingly adjust the connectivity strategy. We validate the effectiveness of the proposed algorithm through extensive evaluations. Results demonstrate that the proposed algorithm can improve the convergence efficiency, reduce the connection latency, and enhance the attack-resilience capability significantly.",
      "authors": [
        "Bo Yang",
        "Min Liu"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.5555/3306127.3331907",
      "keywords": [
        "adversarial learning",
        "unmanned aerial vehicles",
        "connectivity establishment",
        "smart attacks"
      ],
      "number_of_pages": 9,
      "pages": "1743-1751",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450363099",
        "issn": null,
        "publisher": "International Foundation for Autonomous Agents and Multiagent Systems",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems"
      },
      "publication_date": "2019-05-08",
      "selected": null,
      "title": "Attack-Resilient Connectivity Game for UAV Networks using Generative Adversarial Learning",
      "urls": [
        "https://dl.acm.org/doi/10.5555/3306127.3331907"
      ]
    },
    {
      "abstract": "LiDAR technology is essential for self-driving cars, which have seen a surge in interest and investments from startups and established automotive corporations alike. However, the task of automated driving requires high resolution and significant depth-range capabilities of the sensor, keeping its cost prohibitive. Super-resolution of depth maps has been explored as a potential circumvention of these problems, with a substantial number of methods being analyzed in the past few years, yielding various levels of success. We propose a super-resolution algorithm trained for depth-map data and LiDAR compatibility using Generative Adversarial Networks (GANs).",
      "authors": [
        "Steffen Lim",
        "Sams Khan",
        "Matteo Alessandro",
        "Kevin McFall"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3299815.3314482",
      "keywords": [
        "Depth Image",
        "LiDAR",
        "Machine Learning",
        "Deep Learning",
        "GAN",
        "Super Resolution"
      ],
      "number_of_pages": 2,
      "pages": "262-263",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450362511",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2019 ACM Southeast Conference"
      },
      "publication_date": "2019-04-18",
      "selected": null,
      "title": "Spatio-temporal Super-resolution with Photographic and Depth Data using GANs",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3299815.3314482"
      ]
    },
    {
      "abstract": "Deep neural network (DNN) is nowadays achieving the human-level performance on many machine learning applications like self-driving car, gaming and computer-aided diagnosis. However, recent studies show that such a promising technique has gradually become the major attack target, significantly threatening the safety of machine learning services. On one hand, the adversarial or poisoning attacks incurred by DNN algorithm vulnerabilities can cause the decision misleading with very high confidence. On the other hand, the system-level DNN attacks built upon models, training/inference algorithms and hardware and software in DNN execution, have also emerged for more diversified damages like denial of service, private data stealing. In this paper, we present an overview of such emerging system-level DNN attacks by systematically formulating their attack routines. Several representative cases are selected in our study to summarize the characteristics of system-level DNN attacks. Based on our formulation, we further discuss the challenges and several possible techniques to mitigate such emerging system-level DNN attacks.",
      "authors": [
        "Tao Liu",
        "Nuo Xu",
        "Qi Liu",
        "Yanzhi Wang",
        "Wujie Wen"
      ],
      "categories": null,
      "citations": 4,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3287624.3288751",
      "keywords": [
        "DNN",
        "system-level",
        "security",
        "machine learning",
        "mitigation"
      ],
      "number_of_pages": 6,
      "pages": "506-511",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450360074",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 24th Asia and South Pacific Design Automation Conference"
      },
      "publication_date": "2019-01-21",
      "selected": null,
      "title": "A system-level perspective to understand the vulnerability of deep learning systems",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3287624.3288751"
      ]
    },
    {
      "abstract": "Security is a critical issue for new car generation targeting intelligent transportation systems (ITS), involving autonomous and connected vehicles. In this work we designed a low cost CAN probe and defined analysis tools in order to build attack scenarios. We reuse some threats identified by a previous work. Future researches will address new security protocols.",
      "authors": [
        "Pascal Urien"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/CCNC.2019.8651708",
      "keywords": [],
      "number_of_pages": 4,
      "pages": "1-4",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 16th IEEE Annual Consumer Communications & Networking Conference (CCNC)"
      },
      "publication_date": "2019-01-11",
      "selected": null,
      "title": "Designing Attacks Against Automotive Control Area Network Bus and Electronic Control Units",
      "urls": [
        "https://dl.acm.org/doi/10.1109/CCNC.2019.8651708"
      ]
    },
    {
      "abstract": "Advancement of autonomous driving and vehicular ad-hoc networks (VANETs) have demanded many applications requiring vehicle-to-vehicle (V2V) communications as vehicles cooperatively share their traffic information (collected by sensors) with each other to improve driving safety, traffic efficiency and convenience. In order to secure V2V communications, authentication has been carried out in the presence of the central trusted authority and infrastructures. However, the scenarios where the infrastructures are not available have not been addressed well. In this paper, we propose LIDAR, a lidar information based authentication mechanism for V2V communication, to authenticate vehicles locally without involvement of a trusted authority and infrastructures. Our protocol utilizes the sensors installed in vehicles to verify the shared surrounding objects. The proposed scheme is robust against possible security threats such as man-in-the-middle attack. An extensive simulation is also conducted in an autonomous driving environment to evaluate our scheme.",
      "authors": [
        "Kiho Lim",
        "Kastuv M. Tuladhar"
      ],
      "categories": null,
      "citations": 3,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/CCNC.2019.8651684",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "1-6",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2019 16th IEEE Annual Consumer Communications & Networking Conference (CCNC)"
      },
      "publication_date": "2019-01-11",
      "selected": null,
      "title": "LIDAR: Lidar Information based Dynamic V2V Authentication for Roadside Infrastructure-less Vehicular Networks",
      "urls": [
        "https://dl.acm.org/doi/10.1109/CCNC.2019.8651684"
      ]
    },
    {
      "abstract": "Unmanned aerial vehicles (UAVs), also known as drones, provides unique functionalities, which allows area surveillance, inspection, surveying, unarmed cargo, armed attack machines, and aerial photography. Drones are susceptible to GPS spoofing attacks, integrity attacks and de-authentication attacks, which can allow criminals to access data, intercept the drone and use it commit a crime. Thus, this paper is presented to report on potential attacks against the Parrot Bebop 2 drone, and the ability for an investigator to collect evidence about the attacks on the drone. This paper aims at examining the possibility of establishing ownership and collecting data to reconstruct events, linking the drone controller with the drone to prove ownership, flight origins and other potentially useful information necessary to identify the proprietor of a crime. In addition, we have also proposed small-scale drone ontology for modelling drone context data, and simple forensic processing framework for small-scale drones.",
      "authors": [
        "Farkhund Iqbal",
        "Benjamin Yankson",
        "Maryam A. AlYammahi",
        "Naeema AlMansoori",
        "Suaad Mohammed Qayed",
        "Babar Shah",
        "Thar Baker"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1504/ijesdf.2019.100473",
      "keywords": [
        "digital forensics",
        "investigation",
        "drone security",
        "drone attack",
        "context data",
        "drone ontology"
      ],
      "number_of_pages": 19,
      "pages": "245-264",
      "publication": {
        "category": "Journal",
        "cite_score": 2.0,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "1751-911X",
        "publisher": "Inderscience Enterprises Ltd",
        "sjr": 0.243,
        "snip": 0.523,
        "subject_areas": [
          "Law",
          "Safety, Risk, Reliability and Quality",
          "Computer Networks and Communications"
        ],
        "title": "Int. J. Electron. Secur. Digit. Forensic"
      },
      "publication_date": "2019-01-01",
      "selected": null,
      "title": "Drone forensics: examination and analysis",
      "urls": [
        "https://dl.acm.org/doi/10.1504/ijesdf.2019.100473"
      ]
    },
    {
      "abstract": "In the era of the Unmanned Aerial Vehicles (UAVs) several kinds of applications were born to make use of these autonomous vehicles, from surveillance to emergency management, from entertainment to package delivery. All these systems are based on the autonomous...",
      "authors": [
        "Trotta, Angelo",
        "Sciullo, Luca"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-02931-9_19",
      "keywords": [
        "QoS",
        "Mobility system",
        "UAV",
        "Coverage",
        "Wireless network",
        "Nature-inspired"
      ],
      "number_of_pages": 13,
      "pages": "233-245",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-02930-2",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "Wired/Wireless Internet Communications: 16th IFIP WG 6.2 International Conference, WWIC 2018, Boston, MA, USA, June 18–20, 2018, Proceedings"
      },
      "publication_date": "2018-12-29",
      "selected": null,
      "title": "QoS-Based Mobility System for Autonomous Unmanned Aerial Vehicles Wireless Networks",
      "urls": [
        "https://link.springer.com/content/pdf/10.1007/978-3-030-02931-9_19.pdf",
        "https://dl.acm.org/doi/10.1007/978-3-030-02931-9_19"
      ]
    },
    {
      "abstract": "Autonomous vehicles are expected to be a disruptive technology that has the potential to revolutionize the human mobility. However, the recent research progress on intra-vehicle network (e.g., the revealing of a series of security vulnerabilities of CAN design) has demonstrated that the security issue still represents one of the major challenges of future self-driving cars. In this study, we propose a novel edge based anomaly detection system, coined VeAnDe, which exploits edge based sensor data fusion to identify the anomaly events. VeAnDe analyzes pair-wise correlations between different intra-vehicle sensors, and utilizes these correlations to examine whether an anomaly has occurred within the vehicle. More specifically, the pair-wise correlations are organized as ring architecture to reduce the computation overhead. Furthermore, the major components of VeAnDe are embedded in edge computing devices, which enables VeAnDe to be more efficient and privacy-preserving. We evaluate the performance of VeAnDe under different scenarios, and our experimental results demonstrate its feasibility and efficiency.",
      "authors": [
        "Zichang Wang",
        "Fei Guo",
        "Yan Meng",
        "Huaxin Li",
        "Haojin Zhu",
        "Zhenfu Cao"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/GLOCOM.2018.8647567",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "1-7",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE Global Communications Conference (GLOBECOM)"
      },
      "publication_date": "2018-12-09",
      "selected": null,
      "title": "Detecting Vehicle Anomaly by Sensor Consistency: An Edge Computing Based Mechanism",
      "urls": [
        "https://dl.acm.org/doi/10.1109/GLOCOM.2018.8647567"
      ]
    },
    {
      "abstract": "Robotic structures that couple autonomous surface vehicles and unmanned underwater vehicles in integrated systems with various levels of cooperation provide interesting solutions to the problem of developing efficient, versatile and cost effective tools for exploration, monitoring and exploitation of the underwater environment. In this paper we describe the development and preliminary field testing of an autonomous surface vehichle that can automatically track, deploy and recover a small remotely operated vehicle, which is guided from a shore-ground station. This goal is achieved by exploiting two-ways transmission of data and commands through the umbilical and a wireless link with a shore-ground station. In this way, pilots can experiment telepresence in the underwater environment, avoiding the need of expensive and logistically demanding manned supply vessel. The vehicle is a small aluminum hull boat, equipped with a steering outboard electric motor. A multi-agent system in the ROS framework is proposed for the robotic structure. The use of commercial-off-the-shelf components and the choice of a multi-agent ROS architecture are a mean to reduce costs and to assure performances, modularity and versatility. Field tests in both supervised and autonomous guidance mode have been performed in order to assess the basic functionalities of the system and their results are illustrated and discussed.",
      "authors": [
        "Giuseppe Conte",
        "David Scaradozzi",
        "Daniele Mannocchi",
        "Paolo Raspa",
        "Luca Panebianco",
        "Laura Screpanti"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.5555/3288993.3289011",
      "keywords": [
        "Remote control",
        "Marine robotics",
        "Autonomous surface Vehicles",
        "ROS"
      ],
      "number_of_pages": 14,
      "pages": "705-718",
      "publication": {
        "category": "Journal",
        "cite_score": 6.8,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0921-0296",
        "publisher": "Springer Netherlands",
        "sjr": 0.861,
        "snip": 1.437,
        "subject_areas": [
          "Artificial Intelligence",
          "Mechanical Engineering",
          "Software",
          "Control and Systems Engineering",
          "Electrical and Electronic Engineering",
          "Industrial and Manufacturing Engineering"
        ],
        "title": "J. Intell. Robotics Syst."
      },
      "publication_date": "2018-12-01",
      "selected": null,
      "title": "Development and Experimental Tests of a ROS Multi-agent Structure for Autonomous Surface Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.5555/3288993.3289011"
      ]
    },
    {
      "abstract": "Deep Learning (DL) models have been shown to be vulnerable to adversarial attacks. In light of the adversarial attacks, it is critical to reliably quantify the confidence of the prediction in a neural network to enable safe adoption of DL models in autonomous sensitive tasks (e.g., unmanned vehicles and drones). This article discusses recent research advances for unsupervised model assurance against the strongest adversarial attacks known to date and quantitatively compare their performance. Given the widespread usage of DL models, it is imperative to provide model assurance by carefully looking into the feature maps automatically learned within D1 models instead of looking back with regret when deep learning systems are compromised by adversaries.",
      "authors": [
        "Bita Darvish Rouhani",
        "Mohammad Samragh",
        "Mojan Javaheripi",
        "Tara Javidi",
        "Farinaz Koushanfar"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3240765.3274525",
      "keywords": [],
      "number_of_pages": 4,
      "pages": "1-4",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE/ACM International Conference on Computer-Aided Design (ICCAD)"
      },
      "publication_date": "2018-11-05",
      "selected": null,
      "title": "Assured Deep Learning: Practical Defense Against Adversarial Attacks",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3240765.3274525"
      ]
    },
    {
      "abstract": "Recent advances in adversarial Deep Learning (DL) have opened up a largely unexplored surface for malicious attacks jeopardizing the integrity of autonomous DL systems. With the wide-spread usage of DL in critical and time-sensitive applications, including unmanned vehicles, drones, and video surveillance systems, online detection of malicious inputs is of utmost importance. We propose DeepFense, the first end-to-end automated framework that simultaneously enables efficient and safe execution of DL models. DeepFense formalizes the goal of thwarting adversarial attacks as an optimization problem that minimizes the rarely observed regions in the latent feature space spanned by a DL network. To solve the aforementioned minimization problem, a set of complementary but disjoint modular redundancies are trained to validate the legitimacy of the input samples in parallel with the victim DL model. DeepFense leverages hardware/software/algorithm co-design and customized acceleration to achieve just-in-time performance in resource-constrained settings. The proposed countermeasure is unsupervised, meaning that no adversarial sample is leveraged to train modular redundancies. We further provide an accompanying API to reduce the non-recurring engineering cost and ensure automated adaptation to various platforms. Extensive evaluations on FPGAs and GPUs demonstrate up to two orders of magnitude performance improvement while enabling online adversarial sample detection.",
      "authors": [
        "Bita Darvish Rouhani",
        "Mohammad Samragh",
        "Mojan Javaheripi",
        "Tara Javidi",
        "Farinaz Koushanfar"
      ],
      "categories": null,
      "citations": 30,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3240765.3240791",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "1-8",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE/ACM International Conference on Computer-Aided Design (ICCAD)"
      },
      "publication_date": "2018-11-05",
      "selected": null,
      "title": "DeepFense: Online Accelerated Defense Against Adversarial Deep Learning",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3240765.3240791"
      ]
    },
    {
      "abstract": "Traffic lights perception problem is one of the key challenges for autonomous vehicle controllers in urban areas. While a number of approaches for traffic light detection have been proposed, these methods often require a prior knowledge of map and/or show high false positive rates. Recent successes suggest that deep neural networks will be widely used in self-driving cars, but current public datasets do not provide sufficient amount of labels for training such large deep neural networks. In this paper, we developed a two-step computational method that can detect traffic lights from images in a real-time manner. The first step exploits a deep neural object detection architecture to fine true traffic light candidates. In the second step, a point-based reward system is used to eliminate false traffic lights out of the candidates. To evaluate the proposed approach, we collected a human-annotated large-scale traffic lights dataset (over 60 hours). We also designed a real-world experiment with an instrumented self-driving vehicle and observed that the proposed method was able to handle false traffic lights substantially better compared with the baseline considered.",
      "authors": [
        "Jinkyu Kim",
        "Hyunggi Cho",
        "Myung Hwangbo",
        "Jaehyung Choi",
        "John Canny",
        "Youngwook Paul Kwon"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ITSC.2018.8569575",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "280-285",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "978-1-7281-0321-1",
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 21st International Conference on Intelligent Transportation Systems (ITSC)"
      },
      "publication_date": "2018-11-04",
      "selected": null,
      "title": "Deep Traffic Light Detection for Self-driving Cars from a Large-scale Dataset",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ITSC.2018.8569575"
      ]
    },
    {
      "abstract": "This paper presents a synthesis of techniques enabling vision-based autonomous Unmanned Aerial Vehicle (UAV) systems. A full stack of computer vision processing modules are used to exploit visual information to simultaneously perceive obstacles and refine localization in a GPS-denied environment. An omni-directional stereo-vision based setup is used to build a 3D representation of the surroundings. A fully 3D local obstacle grid, maintained through multiple frames and updated accordingly to the UAV movement, is built accumulating multiple observations coming from the 360 stereo vision sensing suite. Visual data is also used to extract information regarding the drone attitude and position while exploring the environment. Sparse optical flow collected from both front and down facing stereo cameras is used to estimate UAV movement through multiple frames. The down-looking stereo pair is also used to estimate the drone height from the ground and to refine the pose estimation in a Simultaneous Localization and Mapping (SLAM) fashion. An improved A* planning algorithm exploits both the 3D representation of the surroundings and precise localization information in order to find the shortest path and reach the goal through a three dimensional safe trajectory.",
      "authors": [
        "F. Valenti",
        "D. Giaquinto",
        "L. Musto",
        "A. Zinelli",
        "M. Bertozzi",
        "A. Broggi"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ITSC.2018.8569695",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "3886-3891",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "978-1-7281-0321-1",
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 21st International Conference on Intelligent Transportation Systems (ITSC)"
      },
      "publication_date": "2018-11-04",
      "selected": null,
      "title": "Enabling Computer Vision-Based Autonomous Navigation for Unmanned Aerial Vehicles in Cluttered GPS-Denied Environments",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ITSC.2018.8569695"
      ]
    },
    {
      "abstract": "Deep neural networks (DNNs) have enabled success in learning tasks such as image classification, semantic image segmentation and steering angle prediction which can be key components of the computer vision pipeline of safety-critical systems such as autonomous vehicles. However, previous work has demonstrated the feasibility of using physical adversarial examples to attack image classification systems. \\par In this work, we argue that the success of realistic adversarial examples is highly dependent on both the structure of the training data and the learning objective. In particular, realistic, physical-world attacks on semantic segmentation and steering angle prediction constrain the adversary to add localized perturbations, since it is very difficult to add perturbations in the entire field of view of input sensors such as cameras for applications like autonomous vehicles. We empirically study the effectiveness of adversarial examples generated under strict locality constraints imposed by the aforementioned applications. Even with image classification, we observe that the success of the adversary under locality constraints depends on the training dataset. With steering angle prediction, we observe that adversarial perturbations localized to an off-road patch are significantly less successful compared to those on-road. For semantic segmentation, we observe that perturbations localized to small patches are only effective at changing the label in and around those patches, making non-local attacks difficult for an adversary. We further provide a comparative evaluation of these localized attacks over various datasets and deep learning models for each task.",
      "authors": [
        "Vikash Sehwag",
        "Chawin Sitawarin",
        "Arjun Nitin Bhagoji",
        "Arsalan Mosenia",
        "Mung Chiang",
        "Prateek Mittal"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3243734.3278515",
      "keywords": [
        "adversarial examples",
        "deep learning",
        "computer vision"
      ],
      "number_of_pages": 3,
      "pages": "2285-2287",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450356930",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security"
      },
      "publication_date": "2018-10-15",
      "selected": null,
      "title": "Not All Pixels are Born Equal: An Analysis of Evasion Attacks under Locality Constraints",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3243734.3278515"
      ]
    },
    {
      "abstract": "Internet of Battlefield Things (IoBT) devices such as actuators, sensors, wearable devises, robots, drones, and autonomous vehicles, facilitate the Intelligence, Surveillance and Reconnaissance (ISR) to Command and Control and battlefield services. IoBT devices have the ability to collect operational field data, to compute on the data, and to upload its information to the network. Securing the IoBT presents additional challenges compared with traditional information technology (IT) systems. First, IoBT devices are mass produced rapidly to be low-cost commodity items without security protection in their original design. Second, IoBT devices are highly dynamic, mobile, and heterogeneous without common standards. Third, it is imperative to understand the natural world, the physical process(es) under IoBT control, and how these real-world processes can be compromised before recommending any relevant security counter measure. Moreover, unprotected IoBT devices can be used as &#x201C;stepping stones&#x201D; by attackers to launch more sophisticated attacks such as advanced persistent threats (APTs). As a result of these challenges, IoBT systems are the frequent targets of sophisticated cyber attack that aim to disrupt mission effectiveness.",
      "authors": [
        "Charles A Kamhoua"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/ALLERTON.2018.8636060",
      "keywords": [],
      "number_of_pages": 1,
      "pages": "862",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 56th Annual Allerton Conference on Communication, Control, and Computing (Allerton)"
      },
      "publication_date": "2018-10-02",
      "selected": null,
      "title": "Game theoretic modeling of cyber deception in the Internet of Battlefield Things",
      "urls": [
        "https://dl.acm.org/doi/10.1109/ALLERTON.2018.8636060"
      ]
    },
    {
      "abstract": "Pose estimation and mapping are key capabilities of most autonomous vehicles and thus a number of localization and SLAM algorithms have been developed in the past. Autonomous robots and cars are typically equipped with multiple sensors. Often, the sensor suite includes a camera and a laser range finder. In this paper, we consider the problem of incremental ego-motion estimation, using both, a monocular camera and a laser range finder jointly. We propose a new algorithm, that exploits the advantages of both sensors-the ability of cameras to determine orientations well and the ability of laser range finders to estimate the scale and to directly obtain 3D point clouds. Our approach estimates the 5 degrees of freedom relative orientation from image pairs through feature point correspondences and formulates the remaining scale estimation as a new variant of the iterative closest point problem with only one degree of freedom. We furthermore exploit the camera information in a new way to constrain the data association between laser point clouds. The experiments presented in this paper suggest that our approach is able to accurately estimate the ego-motion of a vehicle and that we obtain more accurate frame-to-frame alignments than with one sensor modality alone.",
      "authors": [
        "Kaihong Huang",
        "Cyrill Stachniss"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IROS.2018.8593965",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "671-677",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)"
      },
      "publication_date": "2018-10-01",
      "selected": null,
      "title": "Joint Ego-motion Estimation Using a Laser Scanner and a Monocular Camera Through Relative Orientation Estimation and 1-DoF ICP",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IROS.2018.8593965"
      ]
    },
    {
      "abstract": "Camera relocalization plays a vital role in many robotics and computer vision applications, such as self-driving cars and virtual reality. Recent random forests based methods exploit randomly sampled pixel comparison features to predict 3D world locations for 2D image locations to guide the camera pose optimization. However, these point features are only sampled randomly in images, without considering geometric information such as lines, leading to large errors with the existence of poorly textured areas or in motion blur. Line segments are more robust in these environments. In this work, we propose to jointly exploit points and lines within the framework of uncertainty driven regression forests. The proposed approach is thoroughly evaluated on three publicly available datasets against several strong state-of-the-art baselines in terms of several different error metrics. Experimental results prove the efficacy of our method, showing superior or on-par state-of-the-art performance.",
      "authors": [
        "Lili Meng",
        "Frederick Tung",
        "James J. Little",
        "Julien Valentin",
        "Clarence W. de Silva"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IROS.2018.8593505",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "6827-6834",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)"
      },
      "publication_date": "2018-10-01",
      "selected": null,
      "title": "Exploiting Points and Lines in Regression Forests for RGB-D Camera Relocalization",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IROS.2018.8593505"
      ]
    },
    {
      "abstract": "Real-time Segmentation is of crucial importance to robotics related applications such as autonomous driving, driving assisted systems, and traffic monitoring from unmanned aerial vehicles imagery. We propose a novel two-stream convolutional network for motion segmentation, which exploits flow and geometric cues to balance the accuracy and computational efficiency trade-offs. The geometric cues take advantage of the domain knowledge of the application. In case of mostly planar scenes from high altitude unmanned aerial vehicles (UAVs), homography compensated flow is used. While in the case of urban scenes in autonomous driving, with GPS/IMU sensory data available, sparse projected depth estimates and odometry information are used. The network provides 4.7&#x2A2F; speedup over the state of the art networks in motion segmentation from 153ms to 36ms, at the expense of a reduction in the segmentation accuracy in terms of pixel boundaries. This enables the network to perform real-time on a Jetson T&#x2A2F;2. In order to recuperate some of the accuracy loss, geometric priors is used while still achieving a much improved computational efficiency with respect to the state-of-the-art. The usage of geometric priors improved the segmentation in UAV imagery by 5.2 % using the metric of IoU over the baseline network. While on KITTI-MoSeg the sparse depth estimates improved the segmentation by 12.5 % over the baseline. Our proposed motion segmentation solution is verified on the popular KITTI and VIVID datasets, with additional labels we have produced. The code for our work is publicly available at<sup>1</sup><sup>1</sup>https://github.com/MSiam/RTMotSeg_Geom",
      "authors": [
        "Mennatullah Siam",
        "Sara Eikerdawy",
        "Mostafa Gamal",
        "Moemen Abdel-Razek",
        "Martin Jagersand",
        "Hong Zhang"
      ],
      "categories": null,
      "citations": 2,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IROS.2018.8594088",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "5793-5800",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)"
      },
      "publication_date": "2018-10-01",
      "selected": null,
      "title": "Real-Time Segmentation with Appearance, Motion and Geometry",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IROS.2018.8594088"
      ]
    },
    {
      "abstract": "For human drivers, having rear and side-view mirrors is vital for safe driving. They deliver a more complete view of what is happening around the car. Human drivers also heavily exploit their mental map for navigation. Nonetheless, several methods have been published...",
      "authors": [
        "Hecker, Simon",
        "Dai, Dengxin",
        "Van Gool, Luc"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/978-3-030-01234-2_27",
      "keywords": [
        "Autonomous driving",
        "End-to-end learning of driving",
        "Route planning for driving",
        "Surround-view cameras",
        "Driving dataset"
      ],
      "number_of_pages": 20,
      "pages": "449-468",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": 2.2,
        "is_potentially_predatory": false,
        "isbn": "978-3-030-01233-5",
        "issn": "1611-3349",
        "publisher": "Springer Verlag",
        "sjr": 0.32,
        "snip": 0.542,
        "subject_areas": [
          "Theoretical Computer Science",
          "Computer Science (all)"
        ],
        "title": "Computer Vision – ECCV 2018: 15th European Conference, Munich, Germany, September 8–14, 2018, Proceedings, Part VII"
      },
      "publication_date": "2018-09-08",
      "selected": null,
      "title": "End-to-End Learning of Driving Models with Surround-View Cameras and Route Planners",
      "urls": [
        "https://link.springer.com/content/pdf/10.1007/978-3-030-01234-2_27.pdf",
        "https://dl.acm.org/doi/10.1007/978-3-030-01234-2_27"
      ]
    },
    {
      "abstract": " In this paper, we propose DeepRoad, an unsupervised DNN-based framework for automatically testing the consistency of DNN-based autonomous driving systems and online validation. First, DeepRoad automatically synthesizes large amounts of diverse driving scenes without using image transformation rules (e.g. scale, shear and rotation). In particular, DeepRoad is able to produce driving scenes with various weather conditions (including those with rather extreme conditions) by applying Generative Adversarial Networks (GANs) along with the corresponding real-world weather scenes. Second, DeepRoad utilizes metamorphic testing techniques to check the consistency of such systems using synthetic images. Third, DeepRoad validates input images for DNN-based systems by measuring the distance of the input and training images using their VGGNet features. We implement DeepRoad to test three well-recognized DNN-based autonomous driving systems in Udacity self-driving car challenge. The experimental results demonstrate that DeepRoad can detect thousands of inconsistent behaviors for these systems, and effectively validate input images to potentially enhance the system robustness as well.",
      "authors": [
        "Mengshi Zhang",
        "Yuqun Zhang",
        "Lingming Zhang",
        "Cong Liu",
        "Sarfraz Khurshid"
      ],
      "categories": null,
      "citations": 318,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3238147.3238187",
      "keywords": [
        "Deep Neural Networks",
        "Input validation",
        "Test generation",
        "Software testing"
      ],
      "number_of_pages": 11,
      "pages": "132-142",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450359375",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 33rd ACM/IEEE International Conference on Automated Software Engineering"
      },
      "publication_date": "2018-09-03",
      "selected": null,
      "title": "DeepRoad: GAN-based metamorphic testing and input validation framework for autonomous driving systems",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3238147.3238187"
      ]
    },
    {
      "abstract": "High-end vehicles incorporate about one hundred computers; physical and virtualized ones; self-driving vehicles even more. This allows a plethora of attack combinations. This paper demonstrates how to assess exploitability risks of vehicular on-board networks via automatically generated and analyzed attack graphs. Our stochastic model and algorithm combine all possible attack vectors and consider attacker resources more efficiently than Bayesian networks. We designed and implemented an algorithm that assesses a compilation of real vehicle development documents within only two CPU minutes, using an average of about 100 MB RAM. Our proof of concept \"Security Analyzer for Exploitability Risks\" (SAlfER) is 200 to 5 000 times faster and 40 to 200 times more memory-efficient than an implementation with UnBBayes1. Our approach aids vehicle development by automatically re-checking the architecture for attack combinations that may have been enabled by mistake and which are not trivial to spot by the human developer. Our approach is intended for and relevant for industrial application. Our research is part of a collaboration with a globally operating automotive manufacturer and is aimed at supporting the security of autonomous, connected, electrified, and shared vehicles.",
      "authors": [
        "Martin Salfer",
        "Claudia Eckert"
      ],
      "categories": null,
      "citations": 11,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3230833.3230851",
      "keywords": [
        "Vehicle Security",
        "Attack Graph Construction",
        "Vulnerability Assessment",
        "Security Evaluation",
        "Probabilistic Model",
        "Network Hardening"
      ],
      "number_of_pages": 10,
      "pages": "1-10",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450364485",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 13th International Conference on Availability, Reliability and Security"
      },
      "publication_date": "2018-08-27",
      "selected": null,
      "title": "Attack Graph-Based Assessment of Exploitability Risks in Automotive On-Board Networks",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3230833.3230851"
      ]
    },
    {
      "abstract": "This paper makes the case for empowering self-driving networks: empowerment is an information-centric measure which accounts for how \"prepared\" a network is and how much flexibility is preserved over time. While empowerment has been successfully employed in other domains such as robotics, we are not aware of any applications in networking. As a case study for the use of empowerment in networks, we consider self-driving networks offering topological flexibilities, i.e., reconfigurable edges.",
      "authors": [
        "Patrick Kalmbach",
        "Johannes Zerwas",
        "Péter Babarczi",
        "Andreas Blenk",
        "Wolfgang Kellerer",
        "Stefan Schmid"
      ],
      "categories": null,
      "citations": 26,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3229584.3229587",
      "keywords": [
        "Self-driving Networks",
        "Optimization",
        "Network Intelligence"
      ],
      "number_of_pages": 7,
      "pages": "8-14",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450359146",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the Afternoon Workshop on Self-Driving Networks"
      },
      "publication_date": "2018-08-07",
      "selected": null,
      "title": "Empowering Self-Driving Networks",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3229584.3229587"
      ]
    },
    {
      "abstract": "Unmanned Aerial Vehicles &#x2014; UAVs, or drones &#x2014; are now being operated by several military forces and currently, to a more limited extent, by civilian organizations. These latter operations, however, may eventually expand to exceed, in number and diversity, those of the military. Further expected development in battery capacity, construction materials and software, especially regarding machine learning algorithms and drone integration, will definitely increase UAVs&#x2019; autonomous. Unique risks associated with UAVs like risk of hackers&#x2019; attacks to intercept the control are also increasing. More incidents likely will occur once regulations are finalized that encourage more use that is widespread. Such incidents could result in multi-million dollar claims against businesses, operators and manufacturers.Blockchain is the basis technology for cryptocurrencies. However, Blockchain can have far larger applications in the field of UAVs, because Blockchain is highly distributed and publically viewable system of sequentially linked cryptographically.This paper presents a concept of application, where each UAV in the UAVNet is a Blockchain node, has on-board functionality for creating and reading transactions from the block, as well as communication tools for exchanging transactions with other UAVs.",
      "authors": [
        "Alexander Kuzmin",
        "Evgeny Znak"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/SOLI.2018.8476785",
      "keywords": [],
      "number_of_pages": 6,
      "pages": "32-37",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2018 IEEE International Conference on Service Operations and Logistics, and Informatics (SOLI)"
      },
      "publication_date": "2018-07-31",
      "selected": null,
      "title": "Blockchain-base structures for a secure and operate network of semi-autonomous Unmanned Aerial Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1109/SOLI.2018.8476785"
      ]
    },
    {
      "abstract": "Today's software is highly intertwined with our lives, and it possesses an increasing ability to act and influence us. Besides the renown example of self-driving cars and their potential harmfulness, more mundane software such as social networks can introduce bias, break privacy preferences, lead to digital addiction, etc. Additionally, the software engineering (SE) process itself is highly affected by ethical issues, such as diversity and business ethics. This paper introduces ethics-aware SE, a version of SE in which the ethical values of the stakeholders (including developers and users) are captured, analyzed, and reflected in software specifications and in the SE processes. We propose an analytical framework that assists stakeholders in analyzing ethical issues in terms of subject (software artifact or SE process), relevant value (diversity, privacy, autonomy, ...), and threatened object (user, developer, ...). We also define a roadmap that illustrates the necessary steps for the SE research and practice community in order to fully realize ethics-aware SE.",
      "authors": [
        "Fatma Başak Aydemir",
        "Fabiano Dalpiaz"
      ],
      "categories": null,
      "citations": 29,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3194770.3194778",
      "keywords": [
        "ethical software engineering",
        "ethics compliance",
        "requirements engineering",
        "ethical design",
        "ethics"
      ],
      "number_of_pages": 7,
      "pages": "15-21",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450357463",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the International Workshop on Software Fairness"
      },
      "publication_date": "2018-05-29",
      "selected": null,
      "title": "A roadmap for ethics-aware software engineering",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3194770.3194778"
      ]
    },
    {
      "abstract": "Connected and automated vehicles aim to improve the comfort and the safety of the driver and passengers. To this end, car manufacturers continually improve actual standardized methods to ensure their customers safety, privacy, and vehicles security. However, these methods do not support fully autonomous vehicles, linkability and confusion threats. To address such gaps, we propose a systematic threat analysis and risk assessment framework, SARA, which comprises an improved threat model, a new attack method/asset map, the involvement of the attacker in the attack tree, and a new driving system observation metric. Finally, we demonstrate its feasibility in assessing risk with two use cases: Vehicle Tracking and Comfortable Emergency Brake Failure.",
      "authors": [
        "Jean-Philippe Monteuuis",
        "Aymen Boudguiga",
        "Jun Zhang",
        "Houda Labiod",
        "Alain Servel",
        "Pascal Urien"
      ],
      "categories": null,
      "citations": 22,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3198458.3198465",
      "keywords": [
        "threat analysis",
        "security requirements",
        "automotive security",
        "risk assessment"
      ],
      "number_of_pages": 12,
      "pages": "3-14",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450357555",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 4th ACM Workshop on Cyber-Physical System Security"
      },
      "publication_date": "2018-05-22",
      "selected": null,
      "title": "SARA: Security Automotive Risk Analysis Method",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3198458.3198465"
      ]
    },
    {
      "abstract": "Reliable detection and recognition of planar objects including traffic sign, street sign, and road surface in dynamic cluttered natural scenes are a big challenge for self-driving cars. In this paper, we propose a comprehensive method for planar object detection and recognition. First, the data association of LIDAR and camera is set up to acquire colorized laser scans, which simultaneously contain both color and geometrical information. Second, we combine three color spaces of RGB, HSV, and CIE L*a*b* with laser reflectivity as an aggregation-based feature vector. Third, the 3-D geometrical characteristics of planar objects that contain planarity, size, and aspect ratio are exploited to further reduce false alarm. Fourth, in order to increase robustness to any viewpoint variation, we present a new virtual camera-based rectification method to synthesize fronto-parallel views of refined object descriptors in 3-D space. Finally, experimental results achieved under a variety of challenging conditions show that integration of color space aggregation and laser reflectivity is superior to individuals. Specifically, the proposed perspective distortion rectification method remarkably eliminates false recognition error by 45.5%. Overall, the detection rate of our comprehensive method has up to 95.87% and the recognition rate even reaches 95.07% for traffic signs ranging within 100 m, with about 33.25 ms average running time per frame.",
      "authors": [
        "Zhidong Deng",
        "Lipu Zhou"
      ],
      "categories": null,
      "citations": 5,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/TITS.2017.2723902",
      "keywords": [],
      "number_of_pages": 11,
      "pages": "1485-1495",
      "publication": {
        "category": null,
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Trans. Intell. Transport. Syst."
      },
      "publication_date": "2018-05-01",
      "selected": null,
      "title": "Detection and Recognition of Traffic Planar Objects Using Colorized Laser Scan and Perspective Distortion Rectification",
      "urls": [
        "https://dl.acm.org/doi/10.1109/TITS.2017.2723902"
      ]
    },
    {
      "abstract": "High precision Global Navigation Satellite System (GNSS) is a crucial feature for geo-localization to enhance future applications such as self-driving of vehicles. Real Time Kinematic (RTK) is a promising technology to achieve centimeter precision in GNSS, however it requires radio communication and to reduce power consumption this is done at meters range, reducing the use in navigation systems. In this work, we present a high precision low power systems that can be energetically autonomous. The proposed approach exploits a GNSS module with RTK combined with a long-range communication radio (LoRa) to achieve a high-precision localization system with minimal wireless radio infrastructure requirements. Wireless sensor nodes, designed to be energy efficient, comprise the system and they include a solar energy harvesting for self-sustainability. Preliminary experimental results, with in-field measurements, show an average accuracy below 1 meter up to more than 1km distance of the end-node from the geostationary reference anchor; with a peak accuracy of only 10cm. Low power consumption is also presented with in-filed measurements.",
      "authors": [
        "Michele Magno",
        "Stefan Rickli",
        "Josefine Quack",
        "Oliver Brunecker",
        "Luca Benini"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IPSN.2018.00043",
      "keywords": [
        "RTK",
        "energy harvesting",
        "localization",
        "low power sensor node",
        "long range communication"
      ],
      "number_of_pages": 2,
      "pages": "160-161",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781538652985",
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 17th ACM/IEEE International Conference on Information Processing in Sensor Networks"
      },
      "publication_date": "2018-04-11",
      "selected": null,
      "title": "Combining LoRa and RTK to achieve a high precision self-sustaining geo-localization system: poster abstract",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IPSN.2018.00043"
      ]
    },
    {
      "abstract": "Deep Neural Networks (DNNs) have demonstrated remarkable performance in a diverse range of applications. Along with the prevalence of deep learning, it has been revealed that DNNs are vulnerable to attacks. By deliberately crafting adversarial examples, an adversary can manipulate a DNN to generate incorrect outputs, which may lead catastrophic consequences in applications such as disease diagnosis and self-driving cars. In this paper, we propose an effective method to detect adversarial examples in image classification. Our key insight is that adversarial examples are usually sensitive to certain image transformation operations such as rotation and shifting. In contrast, a normal image is generally immune to such operations. We implement this idea of image transformation and evaluate its performance in oblivious attacks. Our experiments with two datasets show that our technique can detect nearly 99% of adversarial examples generated by the state-of-the-art algorithm. In addition to oblivious attacks, we consider the case of white-box attacks. We propose to introduce randomness in the process of image transformation, which can achieve a detection ratio of around 70%.",
      "authors": [
        "Shixin Tian",
        "Guolei Yang",
        "Ying Cai"
      ],
      "categories": null,
      "citations": 1,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.5555/3504035.3504542",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "4139-4146",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "978-1-57735-800-8",
        "issn": null,
        "publisher": "AAAI Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the Thirty-Second AAAI Conference on Artificial Intelligence and Thirtieth Innovative Applications of Artificial Intelligence Conference and Eighth AAAI Symposium on Educational Advances in Artificial Intelligence"
      },
      "publication_date": "2018-02-02",
      "selected": null,
      "title": "Detecting adversarial examples through image transformation",
      "urls": [
        "https://dl.acm.org/doi/10.5555/3504035.3504542"
      ]
    },
    {
      "abstract": "Modern cyber-physical systems are complex networked computing systems that electronically control physical systems. Autonomous road vehicles are an important and increasingly ubiquitous instance. Unfortunately, their increasing complexity often leads to security vulnerabilities. Network connectivity exposes these vulnerable systems to remote software attacks that can result in real-world physical damage, including vehicle crashes and loss of control authority. We introduce an integrated architecture to provide provable security and safety assurance for cyber-physical systems by ensuring that safety-critical operations and control cannot be unintentionally affected by potentially malicious parts of the system. Fine-grained information flow control is used to design both hardware and software, determining how low-integrity information can affect high-integrity control decisions. This security assurance is used to improve end-to-end security across the entire cyber-physical system. We demonstrate this integrated approach by developing a mobile robotic testbed modeling a self-driving system and testing it with a malicious attack.",
      "authors": [
        "Jed Liu",
        "Joe Corbett-Davies",
        "Andrew Ferraiuolo",
        "Alexander Ivanov",
        "Mulong Luo",
        "G. Edward Suh",
        "Andrew C. Myers",
        "Mark Campbell"
      ],
      "categories": null,
      "citations": 8,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3264888.3264889",
      "keywords": [],
      "number_of_pages": 12,
      "pages": "48-59",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450359924",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2018 Workshop on Cyber-Physical Systems Security and PrivaCy"
      },
      "publication_date": "2018-01-15",
      "selected": null,
      "title": "Secure Autonomous Cyber-Physical Systems Through Verifiable Information Flow Control",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3264888.3264889"
      ]
    },
    {
      "abstract": "In this work, we develop new DNNs that are robust to state-of-the-art evasion attacks. Our key observation is that adversarial examples are close to the classification boundary. Therefore, we propose region-based classification to be robust to adversarial examples. Specifically, for a benign/adversarial testing example, we ensemble information in a hypercube centered at the example to predict its label. In contrast, traditional classifiers are point-based classification, i.e., given a testing example, the classifier predicts its label based on the testing example alone. Our evaluation results on MNIST and CIFAR-10 datasets demonstrate that our region-based classification can significantly mitigate evasion attacks without sacrificing classification accuracy on benign examples. Specifically, our region-based classification achieves the same classification accuracy on testing benign examples as point-based classification, but our region-based classification is significantly more robust than point-based classification to state-of-the-art evasion attacks.",
      "authors": [
        "Xiaoyu Cao",
        "Neil Zhenqiang Gong"
      ],
      "categories": null,
      "citations": 82,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3134600.3134606",
      "keywords": [
        "evasion attacks",
        "adversarial machine learning",
        "region-based classification"
      ],
      "number_of_pages": 10,
      "pages": "278-287",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450353458",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 33rd Annual Computer Security Applications Conference"
      },
      "publication_date": "2017-12-04",
      "selected": null,
      "title": "Mitigating Evasion Attacks to Deep Neural Networks via Region-based Classification",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3134600.3134606"
      ]
    },
    {
      "abstract": "Similar to the setting of training substitute models, in this paper we propose an effective black-box attack that also only has access to the input (images) and the output (confidence scores) of a targeted DNN. However, different from leveraging attack transferability from substitute models, we propose zeroth order optimization (ZOO) based attacks to directly estimate the gradients of the targeted DNN for generating adversarial examples. We use zeroth order stochastic coordinate descent along with dimension reduction, hierarchical attack and importance sampling techniques to efficiently attack black-box models. By exploiting zeroth order optimization, improved attacks to the targeted DNN can be accomplished, sparing the need for training substitute models and avoiding the loss in attack transferability. Experimental results on MNIST, CIFAR10 and ImageNet show that the proposed ZOO attack is as effective as the state-of-the-art white-box attack (e.g., Carlini and Wagner's attack) and significantly outperforms existing black-box attacks via substitute models.",
      "authors": [
        "Pin-Yu Chen",
        "Huan Zhang",
        "Yash Sharma",
        "Jinfeng Yi",
        "Cho-Jui Hsieh"
      ],
      "categories": null,
      "citations": 786,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3128572.3140448",
      "keywords": [
        "deep learning",
        "neural network",
        "black-box attack",
        "substitute model",
        "adversarial learning"
      ],
      "number_of_pages": 12,
      "pages": "15-26",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450352024",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security"
      },
      "publication_date": "2017-11-03",
      "selected": null,
      "title": "ZOO: Zeroth Order Optimization Based Black-box Attacks to Deep Neural Networks without Training Substitute Models",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3128572.3140448"
      ]
    },
    {
      "abstract": "This work takes the traffic sign recognition system on the self-driving car as an example, and aims at designing an additional mechanism to improve the robustness of the recognition system. It uses a machine learning model which learns the results of the deep learning model's predictions, with human feedback as labels and provides the credibility of current prediction. The mechanism makes use of both the input image and the recognition result as sample space, querying a human user the True/False of current classification result the least number of times, and completing the task of detecting adversarial attacks.",
      "authors": [
        "Weiyu Wang",
        "Quanyan Zhu"
      ],
      "categories": null,
      "citations": 5,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3140368.3140373",
      "keywords": [
        "adversarial machine learning",
        "support vector machine",
        "machine learning security",
        "active learning",
        "deep neural network"
      ],
      "number_of_pages": 4,
      "pages": "27-30",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450352031",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2017 Workshop on Automated Decision Making for Active Cyber Defense"
      },
      "publication_date": "2017-11-03",
      "selected": null,
      "title": "On the Detection of Adversarial Attacks against Deep Neural Networks",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3140368.3140373"
      ]
    },
    {
      "abstract": "3D urban maps with semantic labels and metric information are not only essential for the next generation robots such autonomous vehicles and city drones, but also help to visualize and augment local environment in mobile user applications. The machine vision challenge is to generate accurate urban maps from existing data with minimal manual annotation. In this work, we propose a novel methodology that takes GPS registered LiDAR (Light Detection And Ranging) point clouds and street view images as inputs and creates semantic labels for the 3D points clouds using a hybrid of rule-based parsing and learning-based labelling that combine point cloud and photometric features. The rule-based parsing boosts segmentation of simple and large structures such as street surfaces and building facades that span almost 75% of the point cloud data. For more complex structures, such as cars, trees and pedestrians, we adopt boosted decision trees that exploit both structure (LiDAR) and photometric (street view) features. We provide qualitative examples of our methodology in 3D visualization where we construct parametric graphical models from labelled data and in 2D image segmentation where 3D labels are back projected to the street view images. In quantitative evaluation we report classification accuracy and computing times and compare results to competing methods with three popular databases: NAVTEQ True, Paris-Rue-Madame and TLS (terrestrial laser scanned) Velodyne.",
      "authors": [
        "Babahajiani, Pouria",
        "Fan, Lixin",
        "Kämäräinen, Joni-Kristian",
        "Gabbouj, Moncef"
      ],
      "categories": null,
      "citations": 3,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/s00138-017-0845-3",
      "keywords": [
        "Point cloud",
        "Street view",
        "LiDAR",
        "Semantic segmentation",
        "Robotics",
        "Urban 3D"
      ],
      "number_of_pages": 16,
      "pages": "679-694",
      "publication": {
        "category": "Journal",
        "cite_score": 5.7,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0932-8092",
        "publisher": "Springer Verlag",
        "sjr": 0.591,
        "snip": 1.086,
        "subject_areas": [
          "Hardware and Architecture",
          "Computer Science Applications",
          "Computer Vision and Pattern Recognition",
          "Software"
        ],
        "title": "Machine Vision and Applications"
      },
      "publication_date": "2017-10-01",
      "selected": null,
      "title": "Urban 3D segmentation and modelling from street view images and LiDAR point clouds",
      "urls": [
        "https://dl.acm.org/doi/10.1007/s00138-017-0845-3",
        "https://link.springer.com/content/pdf/10.1007/s00138-017-0845-3.pdf"
      ]
    },
    {
      "abstract": "The exterior surfaces of cars provide so far unutilized opportunities for information display. The exploitation of this space is enabled by current advances in display technologies combined with increased sensor integration, computing power, and connectivity in vehicles. With this motivation, we present a framework, mapping the design space for external vehicle displays. The audience for the displayed information may be other road users, pedestrians, or autonomous systems. This design direction is particularly interesting in the future, as the current direction towards driverless vehicles may be an enabler for increased separation, redesign, and repurposing of vehicle interior and exterior surfaces.",
      "authors": [
        "Ashley Colley",
        "Jonna Häkkilä",
        "Bastian Pfleging",
        "Florian Alt"
      ],
      "categories": null,
      "citations": 25,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3131726.3131760",
      "keywords": [
        "Automotive UI",
        "cars",
        "public displays",
        "interactive surfaces",
        "design space"
      ],
      "number_of_pages": 6,
      "pages": "146-151",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450351515",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct"
      },
      "publication_date": "2017-09-24",
      "selected": null,
      "title": "A Design Space for External Displays on Cars",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3131726.3131760"
      ]
    },
    {
      "abstract": "We describe the Tactical Battle Manager (TBM), an intelligent agent that uses several integrated artificial intelligence techniques to control an autonomous unmanned aerial vehicle in simulated beyond-visual-range (BVR) air combat scenarios. The TBM incorporates goal reasoning, automated planning, opponent behavior recognition, state prediction, and discrepancy detection to operate in a real-time, dynamic, uncertain, and adversarial environment. We describe evidence from our empirical study that the TBM significantly outperforms an expert-scripted agent in BVR scenarios. We also report the results of an ablation study which indicates that all components of our agent architecture are needed to maximize mission performance.",
      "authors": [
        "Michael W. Floyd",
        "Justin Karneeb",
        "Philip Moore",
        "David W. Aha"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.5555/3171837.3171947",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "4714-4721",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9780999241103",
        "issn": null,
        "publisher": "AAAI Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 26th International Joint Conference on Artificial Intelligence"
      },
      "publication_date": "2017-08-19",
      "selected": null,
      "title": "A goal reasoning agent for controlling UAVs in beyond-visual-range air combat",
      "urls": [
        "https://dl.acm.org/doi/10.5555/3171837.3171947"
      ]
    },
    {
      "abstract": "The advancement in Autonomous Vehicles (AVs) has created an enormous market for the development of self-driving functionalities, raising the question of how it will transform the traditional vehicle development process. One adventurous proposal is to open the AV platform to third-party developers, so that AV functionalities can be developed in a crowd-sourcing way, which could provide tangible benefits to both automakers and end users. Some pioneering companies in the automotive industry have made the move to open the platform so that developers are allowed to test their code on the road. Such openness, however, brings serious security and safety issues by allowing untrusted code to run on the vehicle. In this paper, we introduce the concept of an Appified AV platform that opens the development framework to third-party developers. To further address the safety challenges, we propose an enhanced appified AV design schema called AVGUARD, which focuses primarily on mitigating the threats brought about by untrusted code, leveraging theory in the vehicle evaluation field, and conducting program analysis techniques in the cyber security area. Our study provides guidelines and suggested practice for the future design of open AV platforms.",
      "authors": [
        "Yunhan Jack Jia",
        "Ding Zhao",
        "Qi Alfred Chen",
        "Z. Morley Mao"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2017.7995800",
      "keywords": [],
      "number_of_pages": 7,
      "pages": "705-711",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2017 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2017-06-11",
      "selected": null,
      "title": "Towards secure and safe appified automated vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2017.7995800"
      ]
    },
    {
      "abstract": "The detection of small road hazards, such as lost cargo, is a vital capability for self-driving cars. We tackle this challenging and rarely addressed problem with a vision system that leverages appearance, contextual as well as geometric cues. To utilize the appearance and contextual cues, we propose a new deep learning-based obstacle detection framework. Here a variant of a fully convolutional network is proposed to predict a pixel-wise semantic labeling of (i) free-space, (ii) on-road unexpected obstacles, and (iii) background. The geometric cues are exploited using a state-of-the-art detection approach that predicts obstacles from stereo input images via model-based statistical hypothesis tests. We present a principled Bayesian framework to fuse the semantic and stereo-based detection results. The mid-level Stixel representation is used to describe obstacles in a flexible, compact and robust manner. We evaluate our new obstacle detection system on the Lost and Found dataset, which includes very challenging scenes with obstacles of only 5 cm height. Overall, we report a major improvement over the state-of-the-art, with a performance gain of 27.4%. In particular, we achieve a detection rate of over 90% for distances of up to 50 m. Our system operates at 22 Hz on our self-driving platform.",
      "authors": [
        "Sebastian Ramos",
        "Stefan Gehrig",
        "Peter Pinggera",
        "Uwe Franke",
        "Carsten Rother"
      ],
      "categories": null,
      "citations": 5,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1109/IVS.2017.7995849",
      "keywords": [],
      "number_of_pages": 8,
      "pages": "1025-1032",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": null,
        "publisher": "IEEE Press",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "2017 IEEE Intelligent Vehicles Symposium (IV)"
      },
      "publication_date": "2017-06-11",
      "selected": null,
      "title": "Detecting unexpected obstacles for self-driving cars: Fusing deep learning and geometric modeling",
      "urls": [
        "https://dl.acm.org/doi/10.1109/IVS.2017.7995849"
      ]
    },
    {
      "abstract": "Understanding human drivers' behavior is critical for the self-driving cars, and has been intensively studied in the past decade. We exploit the widely available camera and motion sensor data from car recorders, and propose a hybrid method of recognizing driving events based on the random forest approach. The classification results are analyzed by comparing different features, classifiers and filters. A high accuracy of 98.1% on driving behavior classification is obtained and the robustness is verified on a dataset including 2400 driving events.",
      "authors": [
        "Wangjing Cao",
        "Xin Lin",
        "Kai Zhang",
        "Yuhan Dong",
        "Shaolun Huang",
        "Lin Zhang"
      ],
      "categories": null,
      "citations": 16,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3055031.3055060",
      "keywords": [
        "driving event",
        "acceleration",
        "random forest"
      ],
      "number_of_pages": 2,
      "pages": "303-304",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450348904",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 16th ACM/IEEE International Conference on Information Processing in Sensor Networks"
      },
      "publication_date": "2017-04-18",
      "selected": null,
      "title": "Analysis and evaluation of driving behavior recognition based on a 3-axis accelerometer using a random forest approach: poster abstract",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3055031.3055060"
      ]
    },
    {
      "abstract": "This research project investigates the vulnerabilities of civilian Unmanned Aerial Vehicles (UAV) systems and how they can be exploited by law enforcement should a UAV be utilized in a terrorist attack against the United States. Research into the vulnerabilities of civilian UAVs focused primarily on how such systems could be compromised and taken over by a third party, and for law enforcement to exploit as a potential countermeasure. In particular, the focus of the research was on using Internet Protocol (IP) Address and Media Access Control Address spoofing to spoof the UAV controller. Multiple techniques of spoofing attacks were conducted to compromise the UAV systems and allow for precision control from a third party computer. Additional research was conducted into intercepting an autonomous UAV via spoofing. This paper identifies the threats that UAVs pose to the United States, while providing a reliable and safe way to counter certain hostile UAV threat scenarios.",
      "authors": [
        "Philip J. Costello"
      ],
      "categories": null,
      "citations": 4,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1145/3017680.3022449",
      "keywords": [
        "drones",
        "cybersecurity",
        "spoofing",
        "DOS"
      ],
      "number_of_pages": 2,
      "pages": "761-762",
      "publication": {
        "category": "Conference Proceedings",
        "cite_score": null,
        "is_potentially_predatory": false,
        "isbn": "9781450346986",
        "issn": null,
        "publisher": "Association for Computing Machinery",
        "sjr": null,
        "snip": null,
        "subject_areas": [],
        "title": "Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education"
      },
      "publication_date": "2017-03-08",
      "selected": null,
      "title": "Identifying and Exploiting Vulnerabilities in Civilian Unmanned Aerial Vehicle Systems and Evaluating and Countering Potential Threats Against the United States Airspace",
      "urls": [
        "https://dl.acm.org/doi/10.1145/3017680.3022449"
      ]
    },
    {
      "abstract": "The paper introduces an innovative way of exploiting aerial robotics or Unmanned Aerial Vehicles (UAVs) in the communication field which adds up a wider angle of applications to the already vast use of this new technology. Since IEEE&nbsp;802 Wi-Fi technology is popular and widely used nowadays (in smartphones, laptops, access points, smart TVs etc.), performance reducing interference caused by having any two or more close-by 2.4&nbsp;GHz networks on the same channel can occur especially in highly dense populated urban areas. We design an aerial robot (UAV) with a powerful Wi-Fi receiver along with high gain antennas and some other equipment enabling it to operate as a so called Passive sniffer, listening to all Wi-Fi traffic in range and extracting network information along with GPS coordinates and illustrate the results on Geographical maps using Wi-Fi Triangulation Techniques. Having such capabilities on an autonomous aerial robot enables geographical packet analysis and the observation of widespread traffic, plus the ability to analyse and graph the areas with coverage and locate the highly crowded areas with higher interference. Therefore finding solutions to mitigate this undesirable performance degrading interference.",
      "authors": [
        "Alajmi, Abdussalam A. A.",
        "Vulpe, Alexandru",
        "Fratu, Octavian"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1007/s11277-016-3851-2",
      "keywords": [
        "Antenna radiation patterns",
        "Unmanned aerial vehicles",
        "Wireless LAN",
        "Simultaneous localization and mapping"
      ],
      "number_of_pages": 17,
      "pages": "297-313",
      "publication": {
        "category": "Journal",
        "cite_score": 4.5,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "0929-6212",
        "publisher": "Springer Netherlands",
        "sjr": 0.545,
        "snip": 0.908,
        "subject_areas": [
          "Electrical and Electronic Engineering",
          "Computer Science Applications"
        ],
        "title": "Wireless Personal Communications"
      },
      "publication_date": "2017-01-01",
      "selected": null,
      "title": "UAVs for Wi-Fi Receiver Mapping and Packet Sniffing with Antenna Radiation Pattern Diversity",
      "urls": [
        "https://dl.acm.org/doi/10.1007/s11277-016-3851-2",
        "https://link.springer.com/content/pdf/10.1007/s11277-016-3851-2.pdf"
      ]
    },
    {
      "abstract": "Accurately quantifying total greenhouse gas emissions e.g., methane from natural systems such as lakes, reservoirs, and wetlands requires the spatial and temporal measurement of both diffusive and ebullitive bubbling emissions. Ebullitive emissions exhibit high spatial and temporal variability and as such are difficult to measure. Traditional manual measurement techniques provide only limited localized assessment of methane flux, often introducing significant errors when extrapolated to the whole-of-system. This is further exacerbated when whole-of-region estimates are developed for inclusion in global greenhouse gas inventories. In this paper, we directly address these current sampling limitations by comparing two robot boat-based sampling systems with complementary sensing modalities to directly measure in real time the spatiotemporal release of methane to atmosphere across inland waterways. The first system consists of a single Autonomous Surface Vehicle ASV fitted with an Optical Methane Detector with algorithms to exploit the robot's mobility and transect repeatability for the accurate detection and quantification of methane bubbles across whole-of-system. The second system consists of multiple networked ASVs capable of persistent operation and scalable to whole-of-region monitoring. Each ASV carries a novel automated chamber-based gas sampling system to allow simultaneous real-time measurement of methane across the waterway. These ASV systems provide a foundation for persistent large-scale spatiotemporal sampling allowing scientists to develop whole-of-region greenhouse gas estimates and greatly improve global inventory budgets. An overview of the single and multi-robot sampling systems is presented, including their automated methane detection and sampling methodologies for the spatiotemporal quantification of greenhouse gas release to atmosphere. Experimental results are shown demonstrating each system's ability to autonomously navigate, detect, and quantify methane release to atmosphere across an entire inland reservoir.",
      "authors": [
        "Matthew Dunbabin",
        "Alistair Grinham"
      ],
      "categories": null,
      "citations": 0,
      "comments": null,
      "databases": [
        "ACM"
      ],
      "doi": "10.1002/rob.21665",
      "keywords": [],
      "number_of_pages": 19,
      "pages": "151-169",
      "publication": {
        "category": "Journal",
        "cite_score": 15.7,
        "is_potentially_predatory": false,
        "isbn": null,
        "issn": "1556-4959",
        "publisher": "John Wiley & Sons Inc.",
        "sjr": 2.019,
        "snip": 3.322,
        "subject_areas": [
          "Computer Science Applications",
          "Control and Systems Engineering"
        ],
        "title": "J. Field Robot."
      },
      "publication_date": "2017-01-01",
      "selected": null,
      "title": "Quantifying Spatiotemporal Greenhouse Gas Emissions Using Autonomous Surface Vehicles",
      "urls": [
        "https://dl.acm.org/doi/10.1002/rob.21665"
      ]
    }
  ],
  "processed_at": "2024-01-24 12:54:27",
  "publication_types": [
    "journal",
    "conference proceedings"
  ],
  "query": "(([autonomous] OR [self driving] OR [driverless] OR [unmanned] OR [automated]) AND ([vehicle*] OR [car*] OR [drone*] OR [robot*]) AND ([attack*] OR [exploit*] OR [threat*] OR [adversarial]))",
  "since": "2017-01-01",
  "until": "2020-01-02"
}